{"influencer_tweets": {}, "community_tweets": {}, "reddit_posts": [], "news": [{"id": "41633706", "title": "Solana Community Rejects Major Proposal for Inflation Model Change", "body": "The Solana community rejected the SIMD-0228 proposal for inflation model changes. The proposal aimed to implement a dynamic inflation rate based on staking. Continue Reading: Solana Community Rejects Major Proposal for Inflation Model Change The post Solana Community Rejects Major Proposal for Inflation Model Change appeared first on COINTURK NEWS .", "published_on": "2025-03-14T15:38:53", "url": "https://en.coin-turk.com/solana-community-rejects-major-proposal-for-inflation-model-change/", "source": "cointurken", "categories": ["SOL"], "sentiment": {"polarity": 0.0875, "subjectivity": 0.39999999999999997, "sentiment": "neutral"}, "entities": ["solana"], "topics": ["proposal", "inflation", "solana", "community", "model"]}, {"id": "41633512", "title": "Three Arrows Capital Granted Permission to Expand FTX Claim to $1.53 Billion Amid Bankruptcy Proceedings", "body": "A recent ruling by a U.S. bankruptcy court marks a significant milestone in the ongoing saga of Three Arrows Capital (3AC) and its claims against FTX. This ruling allows 3AC", "published_on": "2025-03-14T15:33:42", "url": "https://en.coinotag.com/three-arrows-capital-granted-permission-to-expand-ftx-claim-to-1-53-billion-amid-bankruptcy-proceedings/", "source": "coinotag", "categories": ["FTT"], "sentiment": {"polarity": 0.1875, "subjectivity": 0.5625, "sentiment": "positive"}, "entities": [], "topics": ["three", "arrow", "capital", "claim"]}, {"id": "41633561", "title": "Ark Invest buys 997 BTC worth $80M via Coinbase as Bitcoin strategy expands", "body": "Ark Invest has added 997 BTC, worth $80 million, to its holdings. The purchase was made in two transactions on the crypto exchange Coinbase. The initial buy was 498 BTC, while the second brought in 499 BTC. Currently, Coinbase is Ark’s third-largest position in the ARKK fund, accounting for over 7% of the portfolio. ARK INVEST RECEIVED $80M OF $BTC FROM COINBASE TODAY ARK INVEST IS BUYING BITCOIN pic.twitter.com/FmpyoNa15A — Arkham (@arkham) March 13, 2025 Ark Invest doubles down on Bitcoin amid market volatility Ark’s strategy is heavily focused on diversification of holdings, with no single holding to represent more than 10% of the value of a fund. This way, as Coinbase shares soar or fall compared to other investments in the funds, the firm can recalibrate. In a recent video , Cathie Wood explained why market volatility could be a catalyst for long-term growth—and how investors can position for it. Cathie Wood explaining market volatility- Source: ARK Invest According to Cathie, market volatility is an opportunity for success. In addition to acquiring Bitcoin, Ark Invest recently increased its Coinbase (COIN) stock holdings. The company acquired 64,358 shares of Coinbase, worth about $11.53 million. This was its largest stake in Coinbase stock since August 2024. Moreover, institutional activities in the crypto space have surged. To illustrate, institutional investors have remained active holders of cryptocurrencies, most investing in Bitcoin ETFs. Despite this, they have negatively impacted the crypto market. Ark Invest sold roughly $9 million of its BTC ETFs invested in the company. This aligns with a broader institutional selling trend. Factors contributing to the selling pressure include the declining performance of the US stock market, inflation concerns, and uncertainties in trade policies. Bitcoin suffers a pullback amid trade war concerns Bitcoin holds the majority share compared to all other cryptocurrencies combined. According to CoinMarketCap , Bitcoin has 61% market dominance. Therefore, most long-term investors view Bitcoin as an essential trading asset. For instance, Wood remains a supporter of Bitcoin. She previously forecasted an increase in BTC price to $1 million per coin by 2030. However, the trading war brought about by institutional buying and selling of cryptocurrency contributes to Bitcoin price fluctuation, diminishing its strength. Nevertheless, Bitcoin’s strength has diminished due to the trade war’s impact, which makes the asset still bearish. Bitcoin’s price traded in the $79,000 range before rising back to the $81,000 mark but faced resistance at the $83,700 level. In case the selling pressure continues, BTC’s price may further decline towards the $75,000 support level. Cryptopolitan Academy: Tired of market swings? Learn how DeFi can help you build steady passive income. Register Now", "published_on": "2025-03-14T15:32:21", "url": "https://www.cryptopolitan.com/ark-invest-buys-997-btc-worth-via-coinbase/", "source": "cryptopolitan", "categories": ["BTC", "EXCHANGE", "MARKET", "TRADING", "BUSINESS"], "sentiment": {"polarity": 0.009373289545703328, "subjectivity": 0.32740831964969896, "sentiment": "neutral"}, "entities": ["bitcoin"], "topics": ["invest", "coinbase", "million", "holding"]}, {"id": "41633398", "title": "Bitcoin ETFs retain 95% of capital despite declining inflows, says Bloomberg analyst", "body": "Bitcoin exchange-traded funds have held onto over 95% of their invested capital, even as inflows slow and Bitcoin’s price declines, according to senior Bloomberg ETF analyst James Seyffart. In a Mar. 14 post on X, Seyffart shared that Bitcoin ETFs have registered declining inflows, dropping to $35 billion from a peak of $40 billion. However, with total assets under management at $115 billion, most funds remain intact despite Bitcoin’s 25% price drop. According to Seyffart, this resilience is comparable to traditional U.S. stock ETFs, where long-term investors don’t panic sell during market downturns but instead keep buying. This investor behavior, he said, indicates a move away from short-term speculation and toward long-term wealth-building tactics. Nice @JSeyff chart of Bitcoin ETF inflows which are down to $35b (from peak of $40b). Based on $115b of aum that means more than 95% of inv cash has held strong despite painful 25% decline = the Boomers are showing y'all how it's done.. *ducks* pic.twitter.com/8OtH6NM33g — Eric Balchunas (@EricBalchunas) March 13, 2025 Meanwhile, data from SoSoValue shows that U.S. spot Bitcoin ETFs have seen $870 million in outflows in the last week and $1.6 billion over the past month. Analysts say the recent outflows are a classic case of “buy the rumor, sell the news.” The Strategic Bitcoin Reserve initiative was first mentioned by Trump in July 2024, which led to speculations and more investors buying Bitcoin. By the time the official announcement was made at the Crypto Summit, the market had already priced it in, leading to a sell-off. You might also like: Texas introduces second Bitcoin reserve bill to allow $250M investment Other indicators suggest Bitcoin’s market is weakening . CryptoQuant contributor Darkfost noted that Bitcoin demand has fallen sharply since December. He pointed to a drop in the 30-day simple moving average of apparent demand, which compares new supply to BTC inactive for over a year. This decline indicates fewer active buyers and a more cautious market. https://twitter.com/darkfost_coc/status/1900253428846387242?s=46&t=nznXkss3debX8JIhNzHmzw Another concerning trend was revealed by the data analytics platform Alphractal on a Mar. 12 X post . The Bitcoin Sharpe Ratio, which determines risk-adjusted returns, has been declining since March 2024. Even as Bitcoin hit all-time highs above $100,000, the ratio showed weakness, indicating rising risk per unit of return. The decline can be attributed to macroeconomic uncertainty, increased volatility, and slowing short-term returns. Returns become less predictable and more volatile when the Sharpe Ratio declines, indicating increased market volatility and possible price corrections . Additionally, Santiment’s data indicates that large Bitcoin holders are selling. In the past week, whale wallets, or those with 100-1,000 BTC, sold over 50,000 BTC totaling approximately $4.07 billion. Changes in whale and shark wallet tiers have historically affected market trends, raising more questions about the short-term prospects of Bitcoin. Read more: Bitcoin volatility rises after Trump’s Bitcoin Reserve and options expiry", "published_on": "2025-03-14T15:32:16", "url": "https://crypto.news/bitcoin-etfs-retain-95-percent-of-capital-despite-spot-etf-outflows-2025/", "source": "crypto_news", "categories": ["BTC", "MARKET", "BUSINESS", "FIAT", "TRADING"], "sentiment": {"polarity": 0.06843125128839415, "subjectivity": 0.4463090084518656, "sentiment": "neutral"}, "entities": ["bitcoin"], "topics": ["decline", "billion", "inflow", "return"]}, {"id": "41633365", "title": "Bezos-Backed Stark Bank Rises as a Crypto Enabler in Brazil", "body": "Stark Bank, a startup backed by Amazon founder Jeff Bezos, has positioned itself as the go-to firm for serving cryptocurrency businesses in Brazil, filling the gap left by traditional institutions. The firm has built part of its business around this service offering, betting on the industry’s future as Brazilians become more comfortable with crypto. Bezos-Backed", "published_on": "2025-03-14T15:30:42", "url": "https://news.bitcoin.com/bezos-backed-stark-bank-rises-as-a-crypto-enabler-in-brazil/", "source": "bitcoin.com", "categories": ["FIAT", "BUSINESS"], "sentiment": {"polarity": 0.011111111111111108, "subjectivity": 0.46388888888888885, "sentiment": "neutral"}, "entities": [], "topics": ["bezosbacked", "stark", "bank", "brazil", "firm"]}, {"id": "41633313", "title": "Shiba Inu (SHIB) Price Prediction for March 14", "body": "The post Shiba Inu (SHIB) Price Prediction for March 14 appeared first on Coinpedia Fintech News Since the first week of December 2024, the Shibarmy has experienced a choppy market for Shiba Inu (SHIB) akin to Ethereum (ETH). The mid-cap dog-themed memecoin, with a fully diluted valuation of about $7.2 billion and a 24-hour average trading volume of about $169 million, has dropped more than 22 percent in the past four weeks to trade about $0.00001239 on Friday, March 14, during the mid-London trading session. As the largest memecoin on the Ethereum network, Shiba Inu price has moved in tandem with Ethereum. Consequently, a potential V-shaped reversal for Ether in the near future could directly impact Shiba Inu price action and the wider altcoin market. Shiba Inu Chart Insights From a technical analysis standpoint, Shiba Inu price is currently retesting a crucial support range between $0.0000128 and $0.00001, which was established in the last year. Additionally, SHIB price has been retesting a crucial support weekly trendline, which must hold to invalidate further market correction. In case of a sudden market reversal, SHIB price will be aiming for the next supply zone between $0.000021 and $0.000025. Favoring Fundamentals Shiba Inu has, over the years of existence, evolved to a utility-based memecoin through the Shibarium layer two (L2) ecosystem. The Shibarium ecosystem has grown to more than a dozen DeFi protocols, with a total value locked of about $1.71M at the time of this writing.As a result, the SHIB token has attracted more than 1.4 million on-chain holders, who have helped increase the network’s overall burn rate. In the past 24 hours, the burn rate of SHIB surged by 27,787 percent, according to on-chain aggregate data from Shibburn", "published_on": "2025-03-14T15:30:23", "url": "https://coinpedia.org/price-analysis/shiba-inu-shib-price-prediction-for-march-14/", "source": "coinpedia", "categories": ["SHIB", "TRADING", "MARKET", "ETH", "ALTCOIN"], "sentiment": {"polarity": 0.09000000000000002, "subjectivity": 0.42033333333333334, "sentiment": "neutral"}, "entities": ["ethereum", "shiba inu", "near protocol"], "topics": ["shiba", "shib", "march", "memecoin"]}, {"id": "33767162", "title": "Bitcoin Expanding Again: Holders Just 10,000 Away From New Record", "body": "On-chain data shows Bitcoin adoption has picked back up again recently, something that could be bullish for the cryptocurrency’s price. Bitcoin Total Amount Of Holders Is Closing In On All-Time High According to data from the on-chain analytics firm Santiment , the Total Amount of Holders has been rising for Bitcoin recently. The “ Total Amount of Holders ” refers to an indicator that, as its name already suggests, measures the number of BTC wallets carrying a non-zero balance. When the value of this metric rises, it can be due to several reasons. New investors joining the network and old ones who had sold earlier reinvesting into the asset can both result in an uptick for the indicator. Existing users creating multiple wallets to manage their holdings or for privacy purposes can also add to the trend. In general, it tends to be a safe assumption that all three of these would occur at once whenever the Total Amount of Holders increases. Thus, some net adoption can be considered to be occurring. On the other hand, the indicator going down implies some investors have decided to clear out their wallets, potentially because they have decided to exit from the cryptocurrency. Here is the chart shared by Santiment, which shows the trend in the Total Amount of Holders for the four top cryptocurrencies: Bitcoin, Ethereum, XRP and USDT. As the above graph shows, Ethereum, XRP, and USDT have been witnessing growth in their Total Amount of Holders for a while now, which means the assets have been enjoying adoption. Conversely, Bitcoin has seen chiefly consolidation in the metric during the last few months. In January, the metric set a new all-time high (ATH) of 54.72 million. Still, the metric saw a plunge shortly after, indicating that the bearish price action forced some investors to sell. Interestingly, even though the asset’s volatility has continued during the last few weeks, the indicator has shown a turnaround, with its value again moving to set a new record. As the analytics firm notes, This is partially due to BTC network growth, and larger wallets splitting into smaller ones. But this does indicate continued expansion of crypto’s top network, despite the nearly 8 weeks of extreme price volatility since Bitcoin’s $109K price all-time high. At present, the Total Amount of Holders is sitting at 54.71 million for Bitcoin, only down 0.018% as compared to the January ATH. BTC Price Despite the positive adoption that has been occurring, Bitcoin has been unable to keep any recovery runs going, as its price is still trading around $81,200.", "published_on": "2025-03-14T15:30:02", "url": "https://bitcoinist.com/bitcoin-expanding-holders-just-10000-new-record/", "source": "bitcoinist", "categories": ["INJ", "ETH", "ASIA", "ALTCOIN", "HNT", "MARKET", "SHIB", "BNB", "EXCHANGE", "BTC", "REGULATION", "TRADING", "OTHER", "DOGE", "SOL", "BLOCKCHAIN", "XRP", "TON", "BUSINESS", "FIAT", "BONK", "PYUSD", "COMMODITY", "ADA", "ZRX", "MINING", "FTT", "DOT", "USDT", "RESEARCH", "FORKS", "IMX", "ICP", "TRX", "TECHNOLOGY", "ARB", "WLD", "SPONSORED", "RAY", "SUI", "PEPE", "WALLET", "UNI", "XMR", "LINK", "NEAR", "SEI", "MATIC", "ARKM", "USDC", "LTC", "LUNA", "AIRDROP", "BTG", "MX", "TOKEN SALE", "BSV", "FLOKI", "TOKEN LISTING AND DELISTING", "BITTENSOR", "HBAR", "CRO", "WIF", "ZEC", "MEME", "MOG", "APE", "JUP", "AAVE", "ONDO", "XTZ", "BGB", "LUNC", "XLM", "APT", "ZK", "MANA", "AR", "AGX", "FET", "AXS", "ADMINISTRATIVE EVENTS", "XDC", "BCH", "MNT", "FIL", "AVAX", "LDO", "SSV", "ETHFI", "ETC", "RUNE", "FDUSD"], "sentiment": {"polarity": 0.03380407852105966, "subjectivity": 0.42175624166190195, "sentiment": "neutral"}, "entities": ["bitcoin", "ethereum", "ripple"], "topics": ["holder", "total", "amount", "adoption"]}, {"id": "41633558", "title": "Solana Price Could Drop 29% From Here, Bloomberg Experts Names This Trending Altcoin The Dogecoin Of 2025", "body": "The price movement of Solana approaches its key support level at $142 while profiteering volumes rise prompting market experts to predict it could drop 29% to reach $110. Analysts view the blockchain with skepticism because of its unreliable stability according to The DeFi Report founder Michael Nadeau who calls it a “house of cards.” The fees from Solana wallets during the last thirty days exceeded $74 million but 95% of this revenue originated from 1.26% of user wallets which primarily exchanged meme coins. Silence about its sustainable future exists thanks to this distribution model. Market interest in the new altcoin Mutuum Finance (MUTM) is intensifying because its presale demand reminds observers of Dogecoin’s massive growth in 2021. Solana’s Fee Boom Masks Fragility The substantial fee increases that Solana experienced due to the PumpFun platform conflict with fundamental technical deficiencies of the network. The network statistics demonstrate that speculation with meme coins dominates the system instead of practical utility functions. The daily Relative Strength Index (RSI) now remains below 50 thus demonstrating decreasing purchase interest. A failure to maintain $142 value might start a liquidation cascade that could drive SOL towards $110. According to Franklin Templeton Solana maintains stable operation and decentralized finance features yet doubts remain about its capacity to expand since its user base is limited and market demand is unpredictable. Mutuum Finance Presale Gains Momentum Mutuum Finance (MUTM) launches its third presale stage as Solana experiences volatility. This is because the platform has amassed $3.2 million from 5,500 investors. Future investors will profit through the upcoming token price increase to $0.025 because the current price stands at $0.02. Public anticipation rises about an exchange listing of MUTM tokens priced at $0.06 during Phase 4 as Phase 3 approaches its capacity fast. This upcoming price represents a potential 200% increase from its current level. Phase 3 participants stand to gain 17400% in returns once Mutuum Finance reaches its projected price of $3.50 after launch. Solana’s speculative activity differs from Mutuum Finance because it utilizes decentralized lending and borrowing and mtTokens serve as collateralized deposit representations. The framework creates self-sustaining market demand through two mechanisms: first it accumulates interest from token holders then employs a token buyback program to keep lowering prices and giving tokens to staking participants. Sustainable Growth Drives Investor Confidence The presale structure of Mutuum Finance uses measures that make it available to a wide range of investors while also ensuring constant expansion. During Phase 3 investors can get access to MTokens at discounted prices which then cause price increments similar to previous DeFi launches. To encourage investment participation the project provides a $100,000 giveaway that awards $10,000 rewards to ten participants. Analysts make a direct connection between MUTM’s development prospects and Dogecoin’s projected 2025 market pattern because of its well-balanced economic system and practical application in the real world which creates exponential growth conditions. Timing the Market Shift The network stability issues of Solana create an opportunity for investors to consider the calculated market proposal known as Mutuum Finance (MUTM). The continuing momentum of MUTM presale demonstrates the market understanding of its secure lending protocols that generate revenue from tokenomics. The Phase 3 release of MUTM presents investors with an opportunity to enter before market values rise since the project provides stability through turbulent market periods. The increasing challenges facing Solana has accelerated the trend to adopt projects which provide both utility and yield. For more information about Mutuum Finance (MUTM) visit the links below: Website: https://www.mutuum.finance/ Linktree: https://linktr.ee/mutuumfinance", "published_on": "2025-03-14T15:30:00", "url": "https://www.cryptopolitan.com/solana-price-could-drop-29-from-here-bloomberg-experts-names-this-trending-altcoin-the-dogecoin-of-2025/", "source": "cryptopolitan", "categories": ["SOL", "MARKET", "TRADING", "BUSINESS", "DOGE"], "sentiment": {"polarity": 0.05828385899814472, "subjectivity": 0.3939734075448362, "sentiment": "neutral"}, "entities": ["solana", "dogecoin"], "topics": ["finance", "solana", "mutuum", "mutm", "investor"]}, {"id": "41633095", "title": "Three Arrows Capital Liquidators Elevate FTX Claim by $1.41 Billion Amid Legal Developments", "body": "The US Bankruptcy Court’s recent ruling allows Three Arrows Capital’s liquidators to substantially raise their claims against FTX, marking a pivotal moment in the ongoing crypto saga. This legal development", "published_on": "2025-03-14T15:24:04", "url": "https://en.coinotag.com/three-arrows-capital-liquidators-elevate-ftx-claim-by-1-41-billion-amid-legal-developments/", "source": "coinotag", "categories": ["REGULATION", "FTT"], "sentiment": {"polarity": 0.22499999999999998, "subjectivity": 0.3625, "sentiment": "positive"}, "entities": [], "topics": ["three", "arrow", "capital", "liquidator"]}, {"id": "41632860", "title": "Will Trump’s ‘Short-Term Pain’ Plan Result in Long-Term Gains for Crypto?", "body": "High-risk assets such as tech stocks and crypto have been selling off heavily over the past month or so as Donald Trump’s trade war escalates. However, this could all be part of a “short term pain” masterplan in a strategy that aims to lower inflation and refinance around $9 trillion of US debt by allowing market weakness, reported the Kobeissi Letter. “We have seen over $5 trillion erased from US stocks with the goal of lowering rates. Will it work?” Planned Market Turmoil The administration appears unified in this approach, with Commerce Secretary Howard Lutnick stating, “Stock market not driving outcomes for this admin,” Treasury Secretary Scott Bessent saying he’s “Not concerned about a little volatility,” and Trump acknowledging a “period of transition” that will “take a little time.” Elon Musk also appears to support this strategy, saying Tesla stock “will be fine long-term” despite TSLA tanking 40% since the beginning of this year. It’s very clear what’s happening: President Trump now believes “short term pain” is his ONLY option to lower inflation and refinance $9+ trillion of US debt. We have seen over -$5 TRILLION erased from US stocks with the goal of LOWERING rates. Will it work? (a thread) pic.twitter.com/QlQYU65AZT — The Kobeissi Letter (@KobeissiLetter) March 13, 2025 This intentional tanking of markets may be driven by several factors, such as a record government deficit reaching $1.15 trillion in February, a desire to lower oil prices, plans to reduce the US trade deficit through tariffs, and a goal to cut government jobs that have accounted for recent job growth. Trump’s economic weakness plans appear to have several goals, including lowering inflation (currently 2.8%), oil prices, and interest rates. He also aims to reduce deficit spending, trade deficits, and government inefficiency. Economist Joe Foudy told Newsweek that this is a “political recognition” before adding: “If the stock market responds negatively or if we see weaker economic data, Trump needs to get ahead of the narrative. By framing short-term economic downturns as necessary for long-term gains, he is managing expectations.” “Normally, the Federal Reserve would lower interest rates to stabilize the economy. But if tariffs drive up prices, policymakers may hesitate, fearing rate cuts could fuel inflation,” commented NYU economics professor Lawrence White. Trump is clearly telling his plans. He doesn’t care about the stock market or the crypto market. All he cares about is that interest rates to go down which will definitely cause some short-term pain. This reminds me of Q4 2021 when Powell was calling for higher rates and… pic.twitter.com/b6SRvNwRf8 — Cas Abbé (@cas_abbe) March 13, 2025 Impacts on Crypto Markets This “short-term pain” approach could lead to significant market volatility across all asset classes, including cryptocurrencies. As traditional markets experience downturns, investors may reduce exposure to high-risk assets like crypto to cover losses elsewhere or move to cash positions, more so if interest rates increase again. Market instability could also lead to liquidity issues in crypto markets, potentially causing exaggerated price movements. Crypto might continue following stock market trends in the short term. The market has already declined by around 25% over the past couple of months as $1 trillion has left the space. In the long term, lowering interest rates could eventually benefit it as an alternative investment when cheap money looks for yields. Moreover, economic instability might accelerate crypto regulation efforts, which could provide clarity and potentially attract more institutional adoption. If the strategy affects dollar strength, which has weakened recently , cryptocurrencies could benefit as alternatives to fiat currencies. Over time, crypto markets could gradually decouple from traditional markets as the sector matures and establishes its own economic cycles, however there is likely to be more pain before any gains. The post Will Trump’s ‘Short-Term Pain’ Plan Result in Long-Term Gains for Crypto? appeared first on CryptoPotato .", "published_on": "2025-03-14T15:17:07", "url": "https://cryptopotato.com/will-trumps-short-term-pain-plan-result-in-long-term-gains-for-crypto/", "source": "cryptopotato", "categories": ["MARKET", "BUSINESS", "REGULATION", "BTC", "COMMODITY"], "sentiment": {"polarity": 0.06439814814814816, "subjectivity": 0.4589351851851851, "sentiment": "neutral"}, "entities": [], "topics": ["rate", "trump", "stock", "could", "pain"]}, {"id": "41633429", "title": "Ripple vs SEC Update: Major Reason XRP Case Lingers", "body": "The ongoing legal battle between Ripple and the U.S. Securities and Exchange Commission (SEC) is nearing a resolution. Journalist and host of the America In Crypto podcast Eleanor Terrett recently revealed that the only hurdles left are the $125 million penalty and the permanent injunction from the court that prevents Ripple from selling tokens to institutional investors. However, Yassin Mobarak, founder of Dizer Capital, believes that Ripple’s primary concern is the permanent injunction, as the company can easily pay the $125 million penalty. This restriction from the injunction has significant implications for Ripple’s business operations. Cancelling the $125M Ripple fine is not the problem. Ripple can pay that without blinking. The issue is the injunction preventing Ripple from selling XRP to institutional investors. That is the big deal. Ripple is negotiating to have that injunction removed somehow. I'm not a… https://t.co/pLloUkjw2K — Yassin Mobarak (@Dizer_YM) March 12, 2025 The SEC has spent the past few weeks dismissing other crypto-related lawsuits and investigations. Mobarak believes the lawsuit resolution is being delayed because the company is negotiating the removal of this injunction. He called on prominent legal experts in the crypto space to explain better, as he is unsure how Ripple can achieve this goal. Legal Experts Weigh In Legal experts have provided insight into ways Ripple might address this issue. Attorney Bill Morgan clarified that Ripple is not attempting to remove the injunction outright but is negotiating for the SEC to consent to a motion requesting the judge to vacate it. However, this outcome is not guaranteed even with the SEC’s consent. We are on twitter, follow us to connect with us :- @TimesTabloid1 — TimesTabloid (@TimesTabloid1) July 15, 2023 MetaLawMan, another well-respected attorney, also recently weighed in on Ripple’s strategy, suggesting that the company might negotiate with the SEC to alter or remove parts of Judge Torres’ decision. While the ruling was favorable for XRP holders, the findings of securities law violations and the injunction created complications for Ripple. MetaLawMan speculated that the SEC would have accepted a straightforward settlement involving both parties dismissing their appeals and Ripple paying the penalty. However, Ripple appears to be pushing for a better deal. Attorney Jeremy Hogan also reacted to the potential resolution after Terrett’s initial report. He noted that the case could conclude soon if Ripple and the SEC reach a private settlement that does not require court approval. However, he questioned whether the SEC would agree to a settlement that effectively bypasses the injunction. He proposed an alternative scenario where the SEC might allow Ripple a regulatory path to register sales of XRP to institutional investors. The Path Forward The resolution of the Ripple lawsuit depends on whether the SEC is willing to negotiate the injunction terms. If the SEC maintains its position, Ripple’s options become limited. However, the regulator has displayed a more pro-crypto stance since the change in administration, and the final decision to vacate the injunction may lie in the hands of the court. Disclaimer : This content is meant to inform and should not be considered financial advice. The views expressed in this article may include the author’s personal opinions and do not represent Times Tabloid’s opinion. Readers are urged to do in-depth research before making any investment decisions. Any action taken by the reader is strictly at their own risk. Times Tabloid is not responsible for any financial losses. Follow us on X , Facebook , Telegram , and Google News The post Ripple vs SEC Update: Major Reason XRP Case Lingers appeared first on Times Tabloid .", "published_on": "2025-03-14T15:13:33", "url": "https://timestabloid.com/ripple-vs-sec-update-major-reason-xrp-case-lingers/", "source": "timestabloid", "categories": ["REGULATION", "XRP", "BUSINESS", "EXCHANGE", "RESEARCH"], "sentiment": {"polarity": 0.08977591036414566, "subjectivity": 0.4697945845004669, "sentiment": "neutral"}, "entities": ["ripple"], "topics": ["ripple", "injunction", "however"]}, {"id": "41633420", "title": "Is This XRP Proposal on the SEC Website Real? Questions Swirl", "body": "A new proposal outlines a timeline for full XRP adoption by March 2026. XRP could free up $1.5 trillion in banking liquidity and save $7.5 billion. SEC can also classify XRP as a payment network to eliminate legal barriers. A new proposal by Maximilian Staudinger, found on the SEC website , suggests Ripple’s XRP could unlock trillions in economic potential for the US, freeing up $1.5 trillion and cutting $7.5 billion in fees. According to the unverified document, the plan outlines a phased approach, beginning with a six-month sprint to resolve legal issues. The proposal suggests that by September 2025, the government would begin testing XRP for payments like tax refunds and Social Security disbursements. It further claims that full integration would follow, with banks adopting XRP to replace traditional banking systems by March 2026. The SEC has proposed XRP to be used as strategic financial asset for the US $XRP are you bullish yet, anon? source pic.twitter.com/vs8cWKDo3b — danny (@defiphvntom) March 13, 2025 The proposal also includes a fast-track process, enabling legal clearance within months through a Presidential Executive Order, with XRP testin… The post Is This XRP Proposal on the SEC Website Real? Questions Swirl appeared first on Coin Edition .", "published_on": "2025-03-14T15:10:43", "url": "https://coinedition.com/is-this-xrp-proposal-on-the-sec-website-real-questions-swirl/", "source": "coinquora", "categories": ["XRP", "REGULATION", "MARKET", "TRADING"], "sentiment": {"polarity": 0.07635046113306981, "subjectivity": 0.46778656126482215, "sentiment": "neutral"}, "entities": ["ripple"], "topics": ["proposal", "website", "march"]}, {"id": "41632779", "title": "Pump.fun turns to DMs and group messaging features after failed livestream experiment", "body": "Pump.fun announced the launch of its direct messaging (DM) and group messaging features on its mobile apps, which will be available for iOS and Android devices on Thursday, March 13, 2023. This new development is coming off the back of the abrupt closure of Pump.fun’s controversial livestreaming feature, which was initially launched in mid-2024. The memecoin launchpad platform is a major driver of traffic and liquidity to the Solana blockchain. introducing DMs on PUMP FUN SEND DMs, CREATE group chats, SEAMLESSLY share coins & much more! EXCLUSIVELY on the pump fun app download NOW 👇 pic.twitter.com/8YKK8DpGrM — pump.fun (@pumpdotfun) March 13, 2025 The rise and fall of Pump.fun’s livestream feature Pump.fun launched its livestream feature to help creators court awareness and engagement around their memecoins. Creators could launch meme tokens and then use livestreaming events to get more users to buy the tokens and drive the prices up in real-time. This concept isn’t exactly novel as e-commerce platforms in countries like China employ similar sales strategies to better demo their products. However, the reality was different from the vision thanks to a lack of content moderation, which is not exactly a staple of the crypto industry. The livestream feature became an arena for harmful content, with users streaming racist, pornographic, and other abusive materials, such as animal abuse and threats to commit bodily harm to themselves and their family members, all in a bid to get more users to buy their memecoins. The series of events caused widespread backlash and forced one of Pump.fun’s founders, Alon Cohen, to announce that it will shut down the livestream feature while they find modern ways to tackle video content moderation. Messaging to the rescue? Following the unfortunate end of the livestream feature, it seems Pump.fun has shifted its focus to DMs and group messaging as one of the tools for community engagement on the platform. It’s also a welcome development as it gives the platform more control over content moderation. However, it doesn’t totally insulate the feature from being abused again. There’s the existential tendency of people trying to do extreme things to court attention for their memecoin launches. It’s just too early to determine how the messaging features will be used. According to speculators, this may also be a chance for Pump.fun to redeem itself from the livestreaming debacle and also get more activity on the platform which has recorded a decline in activity compared to it’s meteoric rise last year. Upon the announcement of the indefinite closure of its livestreaming feature, activities on Pump.fun reportedly dropped by 50% late last year. It saw a temporary uptick earlier in January, but it has been down badly after memecoins such as LIBRA and TRUMP caused tremendous losses to holders despite being heavily supported by leading political figures like Javier Milei and Donald Trump, respectively. Pump.fun has had an eventful year in the memecoin space Despite recent setbacks, Pump.fun remains a dominant player in the memecoin market. Pump.fun launched with lots of promise in January of 2024, and it was responsible for over 70% of the memecoins launched on the Solana blockchain at some point last year. For its creators, Pump.fun has been a lucrative venture as they get to charge a 1% trading fee as well as SOL charges for memecoins that satisfy its criteria to move into larger exchanges. The memecoin launchpad also rakes in large amounts in trading fees, reaching as high as $15 million at its peak. However, Pump.fun’s journey hasn’t exactly been smooth this year as it currently faces a series of class action lawsuits in the United States. In December 2024, the United Kingdom’s financial authority, the Financial Conduct Authority (FCA), warned the public that Pump.fun isn’t authorized to operate in the country, leading to Pump.fun restricting access to its platform to users in the UK. The restriction means UK users still cannot access the memecoin launchpad and its new messaging feature. Adding to Pump.fun’s troubles, its official X account was recently hacked, with attackers promoting fraudulent tokens. As expected, the new messaging feature was received with mixed feelings by Pump.fun’s community. Some users are skeptical, while others are more receptive. One user on X (@0xKaco) said, “Pump fun has always been a social platform 1st and a trading platform 2nd,” with another user highlighting concerns from the livestream mishap and asking if no one will be harassed or sent slurs for selling. Despite all the speculations, some users are already testing the new feature and announcing their new group chats on X. The coming months will be a determinant for many users and speculators of the platform if the new feature is a better upgrade or carry on with the legacy of the livestreaming feature. Cryptopolitan Academy: Tired of market swings? Learn how DeFi can help you build steady passive income. Register Now", "published_on": "2025-03-14T15:10:09", "url": "https://www.cryptopolitan.com/pump-fun-dms-group-messaging-feature/", "source": "cryptopolitan", "categories": ["SOL", "TRADING", "ZRX", "BLOCKCHAIN", "MARKET"], "sentiment": {"polarity": 0.08752881256170734, "subjectivity": 0.39077134123186746, "sentiment": "neutral"}, "entities": ["solana"], "topics": ["feature", "pumpfun", "user", "platform", "messaging"]}, {"id": "41632641", "title": "Could a U.S. Recession Affect Bitcoin Prices? Exploring Potential Impacts on the Crypto Market", "body": "Historically, U.S. recessions have upended global markets. With cryptocurrency now a key asset class in 2025‘s digitally connected and increasingly decentralized world, many investors want to know how a U.S.", "published_on": "2025-03-14T15:09:43", "url": "https://en.coinotag.com/could-a-u-s-recession-affect-bitcoin-prices-exploring-potential-impacts-on-the-crypto-market/", "source": "coinotag", "categories": ["MARKET", "BTC", "BUSINESS"], "sentiment": {"polarity": 0.08333333333333333, "subjectivity": 0.4166666666666667, "sentiment": "neutral"}, "entities": ["bitcoin"], "topics": ["recession", "could", "affect", "price"]}, {"id": "41632530", "title": "Russian oil companies rely on Bitcoin, Ethereum, and stablecoins for trades with China and India: report", "body": "Russian oil firms are using Bitcoin, Ethereum, and stablecoins to convert Chinese yuan and Indian rupees into roubles for trade as Western sanctions persist. Faced with Western sanctions, Russian oil firms are actively turning to cryptocurrencies to move money between China and India, Reuters has learned citing sources close to the matter. One of the sources say some Russian oil companies are using Bitcoin ( BTC ), Ethereum ( ETH ), and stablecoins like Tether ( USDT ) to smooth the conversion of Chinese yuan and Indian rupees to Russian roubles. Although more companies are using crypto, it still makes up a small part of Russia’s oil trade, they add. In one example, a Chinese buyer pays a trading company in yuan into an offshore account. Then, the middleman “converts this into crypto and transfers it to another account and from there, it’s sent to a third account in Russia and converted to roubles,” two sources explained. For one Russian oil trader, “crypto transactions are in the tens of millions of dollars per month,” a source familiar with the trader’s operations said. You might also like: Russian no-KYC crypto exchanges continue to emerge, but inflows decline, Chainalysis says Crypto.news previously reported that the Bank of Russia proposed a regulated framework for cryptocurrency investments under a three-year experimental legal regime. The plan would limit participation to “particularly qualified” investors with over 100 million rubles in securities and deposits or an annual income exceeding 50 million rubles. In May 2024, Bloomberg also reported that Russia’s two largest unsanctioned metal producers began using Tether’s USDT stablecoin for cross-border transactions with Chinese clients and suppliers. The shift came after the U.S. Treasury had warned it would impose secondary sanctions on financial institutions aiding sanctions evasion. Executives at the unnamed companies explained that some transactions are processed through Hong Kong, although the total trade volume is unclear. Read more: Russia’s MinFin says it wants to curb unregulated crypto activity with national infrastructure", "published_on": "2025-03-14T15:09:01", "url": "https://crypto.news/russian-oil-companies-rely-on-bitcoin-ethereum-and-stablecoins-for-trades-with-china-and-india-report/", "source": "crypto_news", "categories": ["COMMODITY", "ASIA", "BTC", "ETH", "USDT"], "sentiment": {"polarity": 0.0568452380952381, "subjectivity": 0.1875, "sentiment": "neutral"}, "entities": ["bitcoin", "ethereum"], "topics": ["russian", "company", "russia", "trade"]}, {"id": "41632533", "title": "New Stablecoin Law Sparks Excitement in the Crypto Market", "body": "The GENIUS Act introduces the first federal regulations for stablecoin companies in the U.S. Experts foresee increased competition among stablecoin companies following the law's implementation. Continue Reading: New Stablecoin Law Sparks Excitement in the Crypto Market The post New Stablecoin Law Sparks Excitement in the Crypto Market appeared first on COINTURK NEWS .", "published_on": "2025-03-14T15:08:49", "url": "https://en.coin-turk.com/new-stablecoin-law-sparks-excitement-in-the-crypto-market/", "source": "cointurken", "categories": ["REGULATION", "MARKET"], "sentiment": {"polarity": 0.15151515151515152, "subjectivity": 0.35505050505050506, "sentiment": "positive"}, "entities": [], "topics": ["stablecoin", "spark", "excitement"]}, {"id": "41632385", "title": "KAS PRICE ANALYSIS & PREDICTION (March 14) – Kas Posts 9% Gains Daily But Faces Resistance Amid Recovery, Where Next?", "body": "KAS continued to maintain a bearish following a steady breakdown on the daily chart. However, it has temporarily stopped bearish due to a bounce and regained strength with notable gains in the past 24 hours. Since last week, KAS has seen a major move as trading levels change to the downside. This came with a monthly breakdown, and the price fell to a new multi-month low of $0.0557. It recovered briefly from the low to retest the recently broken support as resistance and now faces rejection. As a result, the price is weak, following a 2% loss. A further loss could bring selling pressure back into the market. This could later lead to another breakdown capable of plunging the price into the $0.04 range. If the price recovers higher, it may revisit the $0.09 level before losing grip. As of now, there are no signs of strong commitment from the bulls’ side, as the demand level appears low. The only condition for a trend shift lies in a significant increase above the previous monthly low. But from the looks of things, KAS has shown no signs of slowing down yet. Having said that, the overall market is still considered bearish in the mid-term. More selling actions should be expected sooner than later. KAS’s Key Level To Watch Source: Tradingview The $0.076 resistance level is posing a threat. If the price increases above it, the $0.095 level would be the next resistance to keep an eye on, along with $0.1143. The higher levels for a trend shift are $0.135 and $0.155. Currently, the $0.0645 and $0.0557 levels are held as support. A break below it could bring us to $0.05 and potentially $0.04 in the near term. Key Resistance Levels: $0.076, $0.095, $0.1143 Key Support Levels: $0.0645, $0.0557, $0.05 Spot Price: $0.071 Trend: Bearish Volatility: High Disclosure: This is not trading or investment advice. Always do your research before buying any cryptocurrency or investing in any services. Follow us on Twitter @nulltxnews to stay updated with the latest Crypto, NFT, AI, Cybersecurity, Distributed Computing, and Metaverse news !", "published_on": "2025-03-14T15:05:01", "url": "https://nulltx.com/kas-price-analysis-prediction-march-14-kas-posts-9-gains-daily-but-faces-resistance-amid-recovery-where-next/", "source": "themerkle", "categories": ["TRADING", "MARKET", "RESEARCH"], "sentiment": {"polarity": 0.048592031425364765, "subjectivity": 0.3935207631874298, "sentiment": "neutral"}, "entities": ["near protocol"], "topics": ["level", "resistance", "breakdown"]}, {"id": "41632352", "title": "‘There’s Every Reason To Be Cautious’: Trader Issues Alert on Bitcoin Amid Major Resistance – Here’s His Outlook", "body": "A closely followed crypto analyst and trader is warning that Bitcoin ( BTC ) is at high risk of a deeper correction. In a new post, crypto trader Justin Bennett tells his 115,900 followers on the social media platform X that Bitcoin’s market structure is weakening as it fails to regain $92,000 as support. “How do some people still not get it? Bitcoin closed February below $92,000. That happened. There’s nothing else to wait for. So far, March has found resistance there. As long as BTC is below $92,000 on a monthly closing basis, there’s every reason to be cautious on a macro level.” Source: Justin Bennett/X The analyst says even if Bitcoin shows some market strength this month, if it fails to close March above $92,000, the flagship digital asset remains at risk of a collapse. “Nice reclaim of BTC $81,500 + retest. US CPI (Consumer Price Index) came in lower than forecast after some hot January numbers, so most likely some relief from risk assets. I can see $88,000 and possibly a $92,000 sweep, but from there, all eyes shift back to the February breakdown I’ve discussed.” Bennett also says that based on Bitcoin’s historic correlation with the performance of stocks, a market bottom is not likely yet in for BTC as the S&P 500 is correcting. “And if the S&P monthly structure since the Great Financial Crisis (that I’ve shared 117 times) is any indication, we still have a ways to go before we can start talking about a meaningful bottom.” Source: Justin Bennett/X Bitcoin is trading for $80,916 at time of writing, down 3.2% in the last 24 hours. Don't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox Check Price Action Follow us on X , Facebook and Telegram Surf The Daily Hodl Mix Disclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing. Generated Image: Midjourney The post ‘There’s Every Reason To Be Cautious’: Trader Issues Alert on Bitcoin Amid Major Resistance – Here’s His Outlook appeared first on The Daily Hodl .", "published_on": "2025-03-14T15:04:39", "url": "https://dailyhodl.com/2025/03/14/theres-every-reason-to-be-cautious-trader-issues-alert-on-bitcoin-amid-major-resistance-heres-his-outlook/", "source": "dailyhodl", "categories": ["BTC", "MARKET", "TRADING", "BUSINESS"], "sentiment": {"polarity": 0.07431951089845827, "subjectivity": 0.35329213184476344, "sentiment": "neutral"}, "entities": ["bitcoin"], "topics": ["daily", "there", "trader", "risk", "asset"]}, {"id": "41632235", "title": "Analyst warns: Dogecoin’s final ‘cheap’ window is here – Don’t miss out!", "body": "Multiple factors are in line with each other, reinforcing the \"buy low\" strategy. However, is now the right time to follow suit?", "published_on": "2025-03-14T15:00:46", "url": "https://ambcrypto.com/analyst-warns-dogecoins-final-cheap-window-is-here-dont-miss-out/", "source": "ambcrypto", "categories": ["DOGE"], "sentiment": {"polarity": 0.11011904761904762, "subjectivity": 0.4851190476190476, "sentiment": "positive"}, "entities": ["dogecoin"], "topics": ["analyst", "warns", "dogecoins", "final", "cheap"]}, {"id": "41633393", "title": "Web3Bay’s Bold Plan: From Beta to Fully Decentralized Marketplace by 2025", "body": "Web3Bay has big plans for 2025. After raising over $1.6 million during its presale, this decentralized e-commerce platform is now set on a clear path to becoming fully operational by the year’s end. The team behind Web3Bay isn’t just looking at short-term gains; they’re building something long-lasting and community-centered. By transitioning into a Decentralized Autonomous Organization (DAO), Web3Bay will ensure its users—not a centralized group—hold the real power. This is a significant step, transforming how people buy and sell online. The move to decentralization and user control isn’t just innovative; it’s practical. Web3Bay is creating a marketplace that puts the community in charge, offering a new way to shop securely and efficiently. Presale Momentum Sets the Stage The Web3Bay presale has been nothing short of impressive, hitting over $1.6 million and counting. With more than 400 million 3BAY tokens already sold, the marketplace is seeing strong interest from both casual buyers and bigger players. Each presale stage pushes the token price higher, now sitting at $0.005247. But there’s more excitement ahead: the planned launch price is $0.1959, giving early backers a possible return of up to 6430%. This structured presale method, spread across 28 stages, shows that Web3Bay is serious about steady growth. Every new stage bumps the price by 15%, rewarding those who got in early and creating momentum that keeps newcomers engaged. This approach isn’t just good marketing—it shows clear direction and confidence. People see Web3Bay as a serious network capable of delivering long-term results. Moving from Beta to Fully Decentralized Web3Bay isn’t content to remain just another marketplace. The next step is moving from beta into a fully decentralized system. By late 2025, Web3Bay aims to become completely decentralized, meaning the platform won’t rely on any central management team. Instead, it will run entirely through smart contracts and peer-to-peer transactions. This is a major shift from how e-commerce works today, where big companies and intermediaries typically take control. One key feature that will help Web3Bay achieve this decentralization is the integration of smart contract escrow systems. This setup protects buyers and sellers equally, ensuring trust without relying on third-party intermediaries. Additionally, the team plans to expand its payment options to include cryptocurrencies and traditional payment methods, like PayPal, to appeal to the widest possible audience. By removing middlemen and unnecessary fees, Web3Bay is creating a more affordable, fairer trading environment. DAO: Power to the Users Perhaps the most exciting part of Web3Bay’s future is its planned transition into a DAO in Q3 2025. A DAO, or Decentralized Autonomous Organization, means the platform’s users will directly control key decisions about Web3Bay’s operations, fees, upgrades, and policies. Users who hold 3BAY tokens will vote on major changes, shaping the direction of the marketplace. This user governance isn’t just symbolic; it has practical benefits. When users have a direct say in decision-making, the platform adapts faster to community needs. It becomes responsive, transparent, and more attractive for long-term growth. The DAO structure also helps build a loyal user base since people feel they have genuine control and ownership. This democratic, community-driven approach separates Web3Bay from other marketplaces, ensuring the platform’s long-term success. Future Innovations: NFTs and DeFi Integration Web3Bay’s vision goes beyond decentralization and community governance. In late 2025, the marketplace intends to expand further into NFT-based commerce, allowing people to trade goods represented by NFTs. This integration will open new business opportunities, such as selling digital goods, exclusive items, and even collectibles through verified ownership. With NFTs becoming increasingly popular, Web3Bay is tapping into a growing demand, ensuring the marketplace stays relevant. On top of NFT trading, Web3Bay will introduce decentralized finance (DeFi) features, including staking and yield farming, offering extra incentives for users to hold onto their tokens. Staking will reward token holders directly, helping them generate passive income, while DeFi services create even more reasons for people to stay engaged with the platform. These innovations reinforce Web3Bay’s long-term vision, turning a simple marketplace into a full-scale ecosystem of financial and commercial activities. A Community-Driven Future Ahead Web3Bay’s roadmap clearly signals that the team knows exactly where it’s headed. The platform’s journey from its current beta stage toward a fully operational DAO-powered marketplace by the end of 2025 highlights ambition, careful planning, and strong community focus. After a successful presale that captured significant attention, Web3Bay is now set to implement exciting developments that promise to transform how people shop online. From decentralizing control and introducing user governance through a DAO, to integrating NFTs and advanced DeFi tools, Web3Bay offers something special: a marketplace genuinely powered by its community. Users won’t just be passive participants but active decision-makers shaping the platform’s future. If Web3Bay delivers on this promise, it won’t just redefine online commerce—it’ll become the benchmark for how decentralized marketplaces should operate. Join Web3Bay Presale Now: Presale: https://web3bay.io/buy Website: https://web3bay.io/ Twitter: https://x.com/web3bayofficial Instagram: https://www.instagram.com/web3bayofficial/ The post Web3Bay’s Bold Plan: From Beta to Fully Decentralized Marketplace by 2025 appeared first on TheCoinrise.com .", "published_on": "2025-03-14T15:00:40", "url": "https://thecoinrise.com/web3bays-bold-plan-from-beta-to-fully-decentralized-marketplace-by-2025/", "source": "thecoinrise", "categories": ["TRADING", "BUSINESS", "MINING"], "sentiment": {"polarity": 0.1611733880154933, "subjectivity": 0.5388904078377762, "sentiment": "positive"}, "entities": [], "topics": ["webbay", "marketplace", "decentralized", "user", "presale"]}, {"id": "41632240", "title": "CELESTIA PRICE ANALYSIS & PREDICTION (March 14) – TIA Signals a Trend Shift as it Reestablishes Support, Forms a Double-Bottom", "body": "TIA’s outlook remains bearish on the short-term scale, although the landscape could change soon as it forms a new bullish pattern on the daily chart. A breakout of this pattern could trigger a major trend shift. The sharp bounce off the $2.35 level brought a substantial recovery in TIA’s price during last month’s trading, but it was short-lived under $4.5, and the price fell. This triggered a violent drop earlier this month, and the price rolled back amid rising supply throughout last week. This time, the $2.6 level produced support and the crypto-asset increased suddenly to $3.8 yesterday. It faced rejection and dropped to around $3.5 at the time of writing. The price remains strong, but things may go south if it continues to face rejection. A weekly close above the rejected monthly high should validate a slight shift in the trend before rallying hard to the top. Failure to close above this high could result in another drop with a potential breakdown. Another bullish indicator to pay attention to is the double-bottom pattern on the daily chart. This pattern materialized after reestablishing support above the $2.3 level. A notable break above the neckline should confirm a massive bullish move. TIA’s Key Levels To Watch Source: Tradingview Looking ahead, the $4.54 level is the key resistance to watch for a test. A clear break above it could rally the price to $5.7. The next resistance level on the way up is $7.12. While the $3.2 level serves as a pullback area, the $2.63 level continues to support the market. If these levels collapse due to bearish pressure, TIA may navigate last month’s $2.35 low with a breakdown. Key Resistance Levels: $4.54, $5.7, $7.12 Key Support Levels: $3.2, $2.63, $2.35 Spot Price: $3.57 Trend: Bullish Volatility: Low Disclosure: This is not trading or investment advice. Always do your research before buying any cryptocurrency or investing in any services. Follow us on Twitter @nulltxnews to stay updated with the latest Crypto, NFT, AI, Cybersecurity, Distributed Computing, and Metaverse news !", "published_on": "2025-03-14T15:00:36", "url": "https://nulltx.com/celestia-price-analysis-prediction-march-14-tia-signals-a-trend-shift-as-it-reestablishes-support-forms-a-double-bottom/", "source": "themerkle", "categories": ["TRADING", "TIA", "MARKET", "RESEARCH"], "sentiment": {"polarity": 0.02303235053235053, "subjectivity": 0.44552825552825553, "sentiment": "neutral"}, "entities": [], "topics": ["level", "support", "trend", "could"]}, {"id": "41633426", "title": "TRON’s $139M Token Transfers Raise Questions as PI Awaits Binance—$BLEM Presale Becomes the Investor Favorite", "body": "By Trend Tracker on March 14, 2025 | Market Insights What do TRON’s $139 million whale transfers and Pi Network’s looming token unlock mean for investors? Some see opportunity, others see risk. But one thing is certain— BitLemons ($BLEM) is drawing attention for all the right reasons. A fully functional crypto casino with continuous revenue, its business model sets it apart from speculation-driven plays. Adding to the excitement, BitLemons is running a $1 million USDT giveaway , where a $50 investment in $BLEM tokens grants entry for a chance to win 50,000 USDT. With presale interest accelerating, will you take action before the next price jump? $BLEM is Rapidly Selling Out—What’s Driving the Surge? BitLemons operates a fully functional crypto casino that generates continuous revenue. With a platform featuring over 8,000 games from industry leaders like Evolution and Pragmatic, BitLemons is positioned at the forefront of the growing online gaming industry. Unlike many speculative tokens, $BLEM has an active business model that delivers tangible value to its investors. The project’s tokenomics structure ensures that 30% of Gross Gaming Revenue (GGR) directly benefits token holders. Half of this allocation supports strategic buybacks and burns, reducing supply over time, while the other half is distributed as staking rewards. With this model in place, BitLemons creates an ecosystem that supports sustainable long-term value. BitLemons has also secured dual security audits from SpyWolf and SolidProof, reinforcing confidence in the platform. The presale has been moving quickly, with Stage 1 selling out in just 16 days. Stage 2 is now nearly complete, with only a limited amount of $BLEM remaining before the price increases from $0.02 to $0.03. Additionally, strong speculation suggests that high-profile endorsements and influencer partnerships may soon be announced, adding even more momentum to this rapidly growing project. PI Gains Interest with Upcoming Announcements Pi Network’s PI token has seen growing attention as traders speculate on its potential Binance listing and the upcoming Pi Day announcements on March 14. The growing anticipation surrounding these developments has driven increased trading activity, with many looking to secure positions ahead of key updates. Additionally, the approaching deadline for Know Your Customer (KYC) verification and the migration of PI holdings to the mainnet has further contributed to market interest. Despite the optimism, there are factors to consider. The protocol is set to unlock 188 million PI tokens, which could introduce selling pressure into the market. While speculation is high, investors are watching closely to see whether PI can maintain its current momentum once these tokens become available. TRX Sees Uncertainty with Large Transfers TRON’s TRX token is navigating a period of uncertainty following the movement of 629,967,847 TRX—worth approximately $139.5 million—between unknown wallets. A similar large transfer of 264,073,539 TRX was also recorded, leading to speculation about whale activity and potential strategic shifts among major holders. At the moment, TRX is seeing mixed sentiment as market participants assess the impact of these transactions. Large movements like these can often signal upcoming volatility, prompting investors to remain cautious. The coming days will be crucial in determining whether TRX stabilizes or faces further shifts in price direction. $BLEM Delivers Real Results Unlike Pi Network and TRON, which are currently dealing with speculation and market-related uncertainty, BitLemons operates on a revenue-driven model that generates real, consistent earnings. Its active gaming platform provides a steady income stream, making it less dependent on market trends. The deflationary nature of its tokenomics ensures that as the platform scales, the value of $BLEM continues to grow. With a rapidly expanding community and growing adoption, BitLemons is attracting attention from both retail investors and institutional players interested in the gaming sector. As major gaming companies explore crypto integrations, BitLemons is positioning itself as a key player in this evolving landscape. With the presale nearing its next price increase, those looking to invest early have a limited window to do so before $BLEM’s valuation rises further. The current pace of adoption suggests that demand will only grow stronger in the coming weeks. The opportunity is now. Will you seize it? Discover the Exciting Opportunities of BitLemons ($BLEM) Presale Today! Website: https://presale.bitlemons.io/ Socials: https://linktr.ee/bitlemons [Disclaimer: This is a sponsored article and is for informational purposes only. It is not intended to be used as legal, tax, investment, or financial advice.] Disclaimer: This is a sponsored press release for informational purposes only. It does not reflect the views of Times Tabloid, nor is it intended to be used as legal, tax, investment, or financial advice. Times Tabloid is not responsible for any financial losses. The post TRON’s $139M Token Transfers Raise Questions as PI Awaits Binance—$BLEM Presale Becomes the Investor Favorite appeared first on Times Tabloid .", "published_on": "2025-03-14T15:00:11", "url": "https://timestabloid.com/trons-139m-token-transfers-raise-questions-as-pi-awaits-binance/", "source": "timestabloid", "categories": ["BUSINESS", "MARKET", "SPONSORED", "TRADING", "TRX"], "sentiment": {"polarity": 0.0992406204906205, "subjectivity": 0.4704743867243867, "sentiment": "neutral"}, "entities": [], "topics": ["bitlemons", "blem", "investor", "presale"]}, {"id": "41632256", "title": "HTX Offers Stable Returns with “Borrow & Earn” and Diversified Earn Products", "body": "The Bitcoin market experienced extreme volatility in early March 2025, marked by a historic single-day market cap increase followed by its second-largest daily decline within 24 hours. This volatility has led to significant losses for many traders, driving demand for strategies that provide stable yields and liquidity. Crypto lending is gaining popularity as it enables users to keep ownership of their assets while ensuring liquidity. HTX’s “ Borrow & Earn “: High Loan Limits, Ultra-Low Interest Rates, Flexible Repayments, and Prize Pools The leading exchange HTX steps in with its innovative lending campaign “Borrow & Earn,” offering traders a way to navigate market turbulence without missing out on potential gains. The platform’s flagship lending event has successfully completed four rounds. The fifth round will begin on March 14, 2025, at 02:00 (UTC) and end on March 31, 2025, at 15:59 (UTC), offering a 5,000,000,000 $HTX prize pool. Designed as a low-risk, high-reward investment opportunity, the event helps users achieve stable returns despite market fluctuations. During the event, users who borrow USDT from the platform’s Crypto Loans Flexible product will receive a share of the 5,000,000,000 $HTX prize pool, proportional to the interest they pay. The more interest spent, the larger the rewards. All rewards will be distributed within seven business days following the event’s end. Notably, Crypto Loans offers users high loan limits at ultra-low interest rates with flexible repayment options, enabling traders to access capital efficiently while maintaining liquidity for diverse borrowing needs. Additionally, HTX plans to enhance its Crypto Loans offerings in Q2 2025 by introducing multi-assets collateral, aiming to improve capital efficiency and optimize the borrowing experience. Meanwhile, the platform is set to refine its interest rates, expand reward offerings, and roll out lending discount vouchers to further reduce borrowing costs. HTX’s Multiple Investment Tools Boost Resilient Portfolios in a Volatile Market Macroeconomic uncertainty and reduced investor confidence have increased risk aversion in the crypto market. In response, HTX has expanded its risk-mitigation products to balance portfolios in volatile conditions. One of its core yield-generating products, USDD Earn, has emerged as a safe-haven choice. Pegged 1:1 to the U.S. dollar, USDD offers a reliable hedge against market swings. The recent addition of a USDT deposit feature to USDD Flexible Earn enables seamless 1:1 swaps with a 12% APY. To capitalize on market volatility, HTX provides the Futures Grid, an automated arbitrage tool. Designed for choppy market conditions, this solution enables users to profit from both market trends and fluctuations. In response to increasing market volatility, HTX is committed to continuous innovation and industry trend monitoring. By providing secure, accessible, and cutting-edge investment tools, HTX empowers investors to optimize portfolios and navigate uncertainty confidently. The post HTX Offers Stable Returns with “Borrow & Earn” and Diversified Earn Products first appeared on HTX Square .", "published_on": "2025-03-14T15:00:00", "url": "https://square.htx.com/htx-offers-stable-returns-with-borrow-earn-and-diversified-earn-products/", "source": "huobi", "categories": ["MARKET", "BUSINESS", "USDD", "MINING", "USDT"], "sentiment": {"polarity": 0.17106060606060602, "subjectivity": 0.4105050505050505, "sentiment": "positive"}, "entities": ["bitcoin"], "topics": ["earn", "borrow", "product", "user"]}, {"id": "41632204", "title": "XRP Leads Cryptocurrency Spot Fund Inflows with $32.31 Million Amid Major Market Movements", "body": "According to data from Coinglass reported by COINOTAG on March 14th, the cryptocurrency market witnessed significant activity in the past 24 hours. The leading net inflows into cryptocurrency spot funds", "published_on": "2025-03-14T14:58:29", "url": "https://en.coinotag.com/breakingnews/xrp-leads-cryptocurrency-spot-fund-inflows-with-32-31-million-amid-major-market-movements/", "source": "coinotag", "categories": ["XRP", "MARKET", "BNB", "BONK", "PEPE"], "sentiment": {"polarity": 0.046875, "subjectivity": 0.40625, "sentiment": "neutral"}, "entities": ["ripple"], "topics": ["spot", "fund", "inflow", "lead"]}, {"id": "41632097", "title": "PEPE PRICE ANALYSIS & PREDICTION (March 14) – Pepe Sees 13% Gains to Lead Today’s Rally Following a Steady Rebound", "body": "Tuesday marked a temporal halt in Pepe’s bearish move after witnessing a back-to-back drop in the past month. Following a notable surge from its recent low, it appeared strong daily while undergoing a retracement. Looking back, Pepe has shed a lot of loss in the past weeks as the price broke through several support levels to reach a year low of $0.0000052 on Tuesday. This came following a recent dump from $0.0000089. Luckily for the bulls, the low level held as support after an interception and the price bounced back. Reiterating actions yesterday, they managed to close the price an inch above $0.000007 with an engulfing bullish bar. This indicates strong volume inflow in the last 48 hours, and as we can see, the price looks strong on the day despite seeing a slight rejection. If the market further shows strength, Pepe may retest the monthly high, where it initiated a dump earlier this month. Scaling through this high could activate a retracement towards $0.000014 before rolling back. A continuous rejection under this high could result in another leg down, capable of dipping the price to a new yearly low. While it remains under the bears’ radar, it currently leads the daily altcoins gains following a steady recovery since Tuesday. Pepe’s Key Levels To Watch Source: Tradingview Pushing higher, the immediate hurdles for the bulls lie at $0.000089 – marked at the monthly high. A successful surge above it should send the price to $0.0000114 and $0.0000147 in a retracement phase. If the meme coin loses grip, there’s minor support at $0.0000065, while $0.00000526 stands as support. Rolling over these supports could slip the price to $0.0000046 and $0.00000393 – all drawn from April 2024 lows. Key Resistance Levels: $0.0000089, $0.0000114, $0.0000147 Key Support Levels: $0.00000526, $0.0000046, $0.00000393 Spot Price: $0.0000071 Trend: Bearish Volatility: High Disclosure: This is not trading or investment advice. Always do your research before buying any cryptocurrency or investing in any services. Follow us on Twitter @nulltxnews to stay updated with the latest Crypto, NFT, AI, Cybersecurity, Distributed Computing, and Metaverse news !", "published_on": "2025-03-14T14:57:48", "url": "https://nulltx.com/pepe-price-analysis-prediction-march-14-pepe-sees-13-gains-to-lead-todays-rally-following-a-steady-rebound/", "source": "themerkle", "categories": ["TRADING", "PEPE", "ALTCOIN", "BLOCKCHAIN", "MARKET"], "sentiment": {"polarity": 0.08511616161616165, "subjectivity": 0.3932020202020201, "sentiment": "neutral"}, "entities": [], "topics": ["support", "level", "high", "pepe"]}, {"id": "41632095", "title": "Missed Pi? This low-priced crypto could be a promising bet", "body": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only. Lightchain AI is gaining attention as a low-priced crypto with high growth potential, drawing comparisons to Pi Coin’s early days. Table of Contents A smart opportunity for those who missed Pi coin Why Lightchain AI could deliver massive gains Conclusion Regret not buying Pi Coin early? This low-priced crypto could be the next life-changing bet. Lightchain AI, currently priced at just $0.006 and having raised over $17.3 million in its presale, is quickly gaining momentum for its blend of AI and blockchain technology. Positioned for explosive growth in 2025, Lightchain AI offers a unique value proposition that sets it apart from other projects in the space. As investors look for the next big opportunity, Lightchain AI’s strong fundamentals and growing interest make it a promising candidate for massive returns, similar to Pi Coin’s incredible rise. A smart opportunity for those who missed Pi coin For investors who missed out on Pi Coin’s early investment phase, Lightchain AI offers another exciting early investment opportunity. The project is gaining significant attention due to its smart integration of artificial intelligence with blockchain technology. As Lightchain AI progresses toward its mainnet launch in March 2025, investors see potential for substantial growth, with analysts projecting a 15,000% increase in value. The platform’s decentralized governance model, transparent AI framework, and cutting-edge technology make it a compelling investment for those eager to get in early. You might also like: These 3 cryptos are poised to explode in March: Tron, Litecoin and Lightchain AI Why Lightchain AI could deliver massive gains This low-priced crypto could deliver life-changing gains due to its scalability, real-world AI integration, and strong governance model. Lightchain AI’s workflow and data flow ensure smooth execution of AI tasks, optimizing efficiency while maintaining security through cryptographic verification. Its Nodes vs. Performance model allows near-linear scaling, meaning as more nodes join, network efficiency improves without congestion. AI task scalability enables seamless execution of both lightweight and complex AI models, supporting real-time decentralized applications. Additionally, staking for governance empowers token holders to participate in decision-making. This ensures a decentralized, community-driven ecosystem. With strong fundamentals, AI-powered blockchain technology, and increasing adoption, Lightchain AI is positioned as a high-growth investment opportunity capable of delivering significant returns. Conclusion The fear of missing out or regretting not investing in Pi Coin early should not hold investors back from exploring other promising opportunities like Lightchain AI. With its strong fundamentals, smart technology, and potential for massive growth, Lightchain AI is a project worth considering for any investor looking to be on the forefront of the blockchain and AI revolution. For more information on Lightchain AI, visit the website , X , or Telegram . Read more: Pi coin’s success shocked the market, and now experts say Lightchain AI could be next Disclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company.", "published_on": "2025-03-14T14:57:05", "url": "https://crypto.news/missed-pi-this-low-priced-crypto-could-be-a-promising-bet/", "source": "crypto_news", "categories": ["BLOCKCHAIN", "BUSINESS", "TECHNOLOGY", "SPONSORED", "TRADING"], "sentiment": {"polarity": 0.1382350718065004, "subjectivity": 0.5086470143613002, "sentiment": "positive"}, "entities": ["litecoin", "near protocol"], "topics": ["lightchain", "could", "early"]}, {"id": "41632055", "title": "POLKADOT PRICE ANALYSIS & PREDICTION (March 14) – DOT May Hit Five-Year Low if The Price Breaks Lower, Down 3%", "body": "After taking a short break on Tuesday, DOT faced a rejection at $4 and resumed drops. The bears appear set to mount pressure again as supply slowly increases. It looks weak following a 3% loss in the past hours. DOT’s daily outlook remains weak following a roller-coaster reduction in the last three months. Bears have fully taken control in the short term. The early month dump has not just caused panic and fear for the mid-term investors but has put DOT in a more bearish condition over the past few days, and from the look of things, it is not showing signs of slowing down yet. It just resumed selling after taking a day break. The weekly $3.65 low may pose a little threat as the bears slowly mount pressure. A pull-off this low could dip the price to a new multi-year low. Such a dip will bring an end to the bull season and, at the same time, trigger a long-term bearish sentiment. Another pointer to watch for this bearish signal is the steady decline in the daily volume indicator. We may see a short retracement if the bulls defend the weekly low well. But from the look of things, the bears will likely have the upper hand. DOT’s Key Levels To Watch Source: Tradingview Losing the above weekly low in the latest drops, the $3.2 level would be the next line of support to keep in mind. While it marks a five-year low, $3 is the close level in case of more dip. The $4 level has prevented the recent bulls’ pressure. If they overcome it, we may see a retracement move to the $4.7 and $5.3 resistance levels. Above it lies the $6 level. Key Resistance Levels: $4.7, $5.3, $6 Key Support Levels: $3.65, $3.2, $3 Spot Price: $3.95 Trend: Bearish Volatility: High Disclosure: This is not trading or investment advice. Always do your research before buying any cryptocurrency or investing in any services. Follow us on Twitter @nulltxnews to stay updated with the latest Crypto, NFT, AI, Cybersecurity, Distributed Computing, and Metaverse news !", "published_on": "2025-03-14T14:55:13", "url": "https://nulltx.com/polkadot-price-analysis-prediction-march-14-dot-may-hit-five-year-low-if-the-price-breaks-lower-down-3/", "source": "themerkle", "categories": ["DOT", "TRADING", "BUSINESS", "RESEARCH"], "sentiment": {"polarity": 0.0031686179981634532, "subjectivity": 0.37872704315886135, "sentiment": "neutral"}, "entities": ["polkadot"], "topics": ["level", "bear"]}, {"id": "41631944", "title": "Crypto News Today (14th March, 2025): Market Falls Again?", "body": "The post Crypto News Today (14th March, 2025): Market Falls Again? appeared first on Coinpedia Fintech News After a slight recovery yesterday, the crypto market today has incurred some correction by the bears. This time, the business’s market cap has taken a slight dip of 0.94% in the past 24 hours to $2.68 trillion. In the thick of these trends, the total volume has dropped by 10.15% to $90.36 billion. The Fear & Greed Index has now taken a plunge to extreme fear at 18, highlighting traders being extra cautious about their next move. Bitcoin Price Drops Below $83k Bitcoin price today has slashed by 1.42% to $82,004.85, this has come after a drop to its intraday low of $79,931.85. Betwixt the turn of events, trading volume of BTC also dropped steeply by 20.58% to $29.88 billion. For a deeper dive into Bitcoin’s future, explore our Bitcoin (BTC) Price Prediction 2025, 2026-2030 . Altcoins Prices Today: Ethereum Holds Firm Ethereum is presently showing resilience against the broader market’s trends, with an intraday price spike of 1.57% to 1,897.27. Talking about other major altcoins, XRP posted a decent gain of 2.99%, rising to $2.30, while Solana traded in red, slipping by 1.17% to $125.03. Read our XRP Price Prediction 2025, 2026-2030 for potential price targets! Top Gainers & Losers Sonic led the charge, by surging 13.32% to $0.5113. Trump token followed second with a 9.32% price jump, and KAVA registered an 8.82% gain. On the losing side, STORY IP led the losers with a 6.02% fall, while ENA and MOVE sank by 5.16% and 4.70%, respectively. Subscribe to stay tuned for daily insights and in-depth analysis of the ever-evolving crypto market. FAQs How much does 1 BTC cost today? At the time of writing, Bitcoin is priced at $82,004.85. Which altcoins are the top gainers today? Sonic (+13.32%), Trump (+9.32%), and KAVA (+8.82%) are today’s top-performing altcoins. How has Ethereum performed today? Ethereum has gained 1.57% in the last 24 hours, currently trading at $1,897.27.", "published_on": "2025-03-14T14:52:49", "url": "https://coinpedia.org/price-analysis/crypto-news-today-14th-march-2025-market-falls-again/", "source": "coinpedia", "categories": ["MARKET", "BTC", "TRADING", "ALTCOIN", "ETH"], "sentiment": {"polarity": -0.005316091954022985, "subjectivity": 0.30603448275862066, "sentiment": "neutral"}, "entities": ["bitcoin", "ethereum", "ripple", "solana"], "topics": ["today", "altcoins", "news", "fall"]}, {"id": "41631923", "title": "3AC wins court approval to expand FTX bankruptcy claim from $120 million to $1.5 billion", "body": "The court's decision could significantly impact FTX's reorganization efforts and set a precedent for future bankruptcy claims in the crypto sector. The post 3AC wins court approval to expand FTX bankruptcy claim from $120 million to $1.5 billion appeared first on Crypto Briefing .", "published_on": "2025-03-14T14:52:16", "url": "https://cryptobriefing.com/3ac-ftx-bankruptcy-claim-expansion/", "source": "cryptobriefing", "categories": ["REGULATION"], "sentiment": {"polarity": 0.24500000000000002, "subjectivity": 0.3466666666666666, "sentiment": "positive"}, "entities": [], "topics": ["court", "bankruptcy", "claim"]}, {"id": "41631878", "title": "Bitcoin Exchange Coinbase Announces New Memecoin Listing Roadmap! Here Are the Details", "body": "Coinbase has officially added Doginme (DOGINME) to its asset roadmap, signaling potential future support for the memecoin on its platform. Coinbase Adds Meme Coin Doginme (DOGINME) to Asset Roadmap Originating from humorous interactions on the decentralized social media platform Farcaster, DOGINME has gained traction among crypto enthusiasts as part of the growing memecoin trend. While the listing roadmap does not guarantee full integration, assets on this list are often reviewed for trading support. Coinbase has yet to announce a timeline for DOGINME to be officially listed or made available for trading. However, its addition to the asset roadmap suggests that the exchange is evaluating the token for potential listing. Doginme (DOGINME) is a memecoin that emerged from a fun interaction on the decentralized social media platform Farcaster. When Farcaster founder Dan Romero was asked if he had a dog, he humorously replied, “No, but I have that dog in me.” *This is not investment advice. Continue Reading: Bitcoin Exchange Coinbase Announces New Memecoin Listing Roadmap! Here Are the Details", "published_on": "2025-03-14T14:51:07", "url": "https://en.bitcoinsistemi.com/bitcoin-exchange-coinbase-announces-new-memecoin-listing-roadmap-here-are-the-details/", "source": "bitcoinsistemi", "categories": ["EXCHANGE", "TOKEN LISTING AND DELISTING", "BTC", "ALTCOIN", "TRADING"], "sentiment": {"polarity": 0.20479797979797978, "subjectivity": 0.5264520202020201, "sentiment": "positive"}, "entities": ["bitcoin"], "topics": ["doginme", "roadmap", "coinbase", "memecoin", "listing"]}, {"id": "41631495", "title": "Trump-backed World Liberty Financial (WLFI) Completes $590M Token Sale", "body": "World Liberty Financial (WLFI), the Donald Trump-backed crypto project, has closed its token sale after raising approximately $590 million. The project's raise of $590 million would put it in the top-10 list of token raises, according to data curated by ICODrops . To date, the largest token sale is EOS, which raised $4.21 billion. EOS is a blockchain platform developed by Block.one, which later founded Bullish, CoinDesk's owner. On stage at Consensus 2025 in Hong Kong , WLFI co-founder Zak Folkman credited Tron's Justin Sun with the success of the project's token sale. After WLFI first launched its sale, its critics called the momentum sluggish. But this changed after Sun invested $30 million into it in November 2024 and later invested more . \"When we were launching this project, it was a very heated time,\" Folkman said during Consensus. \"There was a lot of scrutiny on our project due to who was involved.\" This meant that traditional crypto VCs would not touch the token. \"[Sun] saw that regardless of the outcome, this project is a monumental move forward for the entire crypto community,\" Folkman added during the Consensus panel. Rules around WLFI's token sale mean that the token was only available to accredited investors and can't be transferred or publicly sold on exchanges. A date has not been set for an exchange listing.", "published_on": "2025-03-14T14:39:43", "url": "https://www.coindesk.com/markets/2025/03/14/trump-backed-world-liberty-financial-wlfi-completes-token-sale", "source": "coindesk", "categories": ["TOKEN SALE", "MARKET", "ASIA", "BLOCKCHAIN", "BUSINESS"], "sentiment": {"polarity": 0.04513888888888888, "subjectivity": 0.33541666666666664, "sentiment": "neutral"}, "entities": [], "topics": ["sale", "project", "wlfi", "million", "consensus"]}, {"id": "41631394", "title": "Major Shift: ZKsync Ends Promotion Program to Focus on Strategic Development", "body": "ZKsync ends its Ignite incentive program due to market downturns and strategic focus. The company will adopt a cautious spending strategy and redirect resources. Continue Reading: Major Shift: ZKsync Ends Promotion Program to Focus on Strategic Development The post Major Shift: ZKsync Ends Promotion Program to Focus on Strategic Development appeared first on COINTURK NEWS .", "published_on": "2025-03-14T14:38:52", "url": "https://en.coin-turk.com/major-shift-zksync-ends-promotion-program-to-focus-on-strategic-development/", "source": "cointurken", "categories": ["ZK", "MARKET"], "sentiment": {"polarity": 0.0625, "subjectivity": 0.4416666666666667, "sentiment": "neutral"}, "entities": [], "topics": ["zksync", "program", "focus", "strategic"]}, {"id": "41631355", "title": "Will Crypto Markets React to $3B Bitcoin Options Expiring Today?", "body": "Around 35,000 Bitcoin options contracts will expire on Friday, March 14, and they have a notional value of roughly $2.9 billion. This week’s event is a little larger than last week’s , but a mammoth end-of-quarter $11 billion options contract expiry is due on March 28. The impact on spot markets is likely to be minimal as markets digest slightly lower-than-expected inflation data from the US this week. Bitcoin Options Expiry This week’s batch of Bitcoin options contracts has a put/call ratio of 0.73, meaning that there are slightly more call (long) contracts expiring than puts (shorts). Moreover, open interest (OI), or the value or number of BTC options contracts yet to expire, remains high at the $120,000 strike price, which is $1.4 billion, according to Deribit. There is also almost $1.6 billion in OI at the $100,000 strike price and $1.3 billion at $120,000. However, the bears are getting bolder, betting almost $850 million that Bitcoin will fall to $70,0000. Crypto derivatives provider Greeks Live said the group was still “predominantly bearish” on the short-term market outlook despite some positive CPI data . “Traders are watching key potential support levels and discussing a potential bottom for BTC, with some suggesting $60k levels as a possible downside target.” It added that “skepticism prevails” as the market faded the good CPI print quickly. Other industry experts and analysts have been baffled as to why there is so much bearish sentiment amid extremely bullish fundamentals. Bitcoin options OI by expiry. Source: Deribit In addition to the Bitcoin options, there are around 220,000 Ethereum contracts that are also expiring today, with a notional value of $416 million and a put/call ratio of 0.68. This brings Friday’s combined crypto options expiry notional value to around $3.3 billion. Crypto Market Outlook Crypto markets are back in the red this Friday with a 3.7% slump in total capitalization, which has fallen to $2.76 trillion. Bitcoin fell back to $80,000 before making a minor recovery to reach $82,000 during the Friday morning Asian session. However, the asset remains weak, and analysts have predicted a fall to $70,000 in a deeper correction. Ethereum remains at bear market levels, with prices failing to top $1,900 following a fall to $1,830. The altcoins are generally mixed with larger losses for Cardano (ADA), Pi Network (PI), and Hedera (HBAR) and minor gains for XRP, Binance Coin (BNB), Tron (TRX), and Stellar (XLM). The post Will Crypto Markets React to $3B Bitcoin Options Expiring Today? appeared first on CryptoPotato .", "published_on": "2025-03-14T14:37:38", "url": "https://cryptopotato.com/will-crypto-markets-react-to-3b-bitcoin-options-expiring-today/", "source": "cryptopotato", "categories": ["BTC", "MARKET", "TRADING", "ADA", "BNB"], "sentiment": {"polarity": 0.04081860269360269, "subjectivity": 0.45769781144781135, "sentiment": "neutral"}, "entities": ["bitcoin", "ethereum", "ripple", "cardano", "stellar"], "topics": ["option", "contract", "billion", "market", "expiring"]}, {"id": "41633424", "title": "Analyst Predicts Timelines For XRP Double and Triple Digit Prices", "body": "Crypto analyst Egrag Crypto has shared a detailed Elliott Wave analysis of XRP, predicting significant price increases in the upcoming market cycles. His latest analysis, which was first shared with subscribers on February 12, 2025, outlines potential price targets for XRP based on historical patterns and technical indicators. Egrag begins his thread by emphasizing the importance of using multiple indicators, stating, “To improve our chances of hitting our targets, we need to use multiple indicators, charts, and patterns. The more signals we collect, the better our odds of success!” He then presents a structured Elliott Wave count to assess XRP’s next potential price levels. #XRP = Thread (1/7) #XRP : Double Digits This Cycle, Triple Digits Next! The thread below about #XRP was shared in the Subscribers section on February 12, 2025. We’ve built together the Full Elliot Wave Count to assess our next Targets: Take an in-depth look at it! … pic.twitter.com/NKv00Y5MZD — EGRAG CRYPTO (@egragcrypto) March 12, 2025 Current Market Position and Initial Projections Egrag identifies a key formation within XRP’s price structure, referring to it as the “JUST-DO-IT CHART.” According to the analyst, “The measured move of the cup pattern (or wave) has formed well within the arc. After the breakout, we confirmed that the pattern is unfolding just as we expected.” This formation suggests that XRP is in the process of setting up for a major price movement. Regarding a potential price target, Egrag states, “It looks like we could be aiming for around $13.” He stresses the reliability of chart-based analysis, remarking, “Men lie, women lie, but charts don’t lie!” Elliott Wave Count and Expected Movements Egrag outlines the fundamental principles of the Elliott Wave theory, explaining how different waves follow predictable patterns. He specifies that “Wave 2 usually retraces 50%, 61.8%, 76.4%, or 85.4% of Wave 1,” while “Wave 3 typically extends to 161.8% of Wave 1.” These calculations form the basis for his projected XRP price movements. At the current stage, Egrag believes XRP is in Wave 2, which is typically a corrective phase before the strongest move in Wave 3. “Wave 1 has increased by 733%. Right now, we’re confirming that we’re in Wave 2. However, I believe we might see a double bottom before completing Wave 2,” he explains. Looking forward, he estimates Wave 3 will experience a significant increase. He calculates, “For Wave 3, we take Wave 1’s 733% and multiply it by 1.618. This gives us a projected 1,185% increase for Wave 3.” If this happens, XRP’s price could rise to around $22 to $24. After Wave 3 peaks, Wave 4 is expected to retrace, with Egrag considering a “worst-case scenario of a 38.2% retracement.” This would lead to a temporary price drop to around $8. We are on twitter, follow us to connect with us :- @TimesTabloid1 — TimesTabloid (@TimesTabloid1) July 15, 2023 Wave 5 and Long-Term XRP Price Potential For the final wave in the Elliott Wave cycle , Egrag provides three different methods to estimate XRP’s potential price target. One approach considers the inverse of 1.236% to 1.618% of Wave 4, which could result in XRP reaching between $32 and $48. Another method assumes that Wave 5 will match the size of Wave 1, leading to a projected price range of $60 to $70. A third calculation, based on 61.8% of the combined moves of Waves 1 and 3, suggests that XRP could climb as high as $100. These projections indicate the potential for XRP to reach triple-digit values in the longer term. Comparison to the 2017 Fractal Egrag compares the current market cycle and the XRP price movement observed in 2017. He believes the similarities between the two periods strengthen the case for a major price rally. In his comparison, Egrag highlights that: Wave 1 and Wave 2 align closely with the 2017 pattern, though the latter had a deeper correction. Wave 3 could reach between $17 and $24, in line with previous price action. Wave 4 could retrace to around $8, though a more bearish scenario might see a drop to $3.40. In the 2017 cycle, Wave 5 saw XRP surpass $100 . In his current model, Egrag identifies potential Wave 5 targets of $32–$48, $60–$70, and $95–$110. using Elliott Wave theory, Egrag Crypto’s latest analysis comprehensively breaks down XRP’s potential price movements. His projections indicate that XRP could reach double digits in the current cycle and climb to triple digits in the next. While market conditions and external factors will play a role, his analysis suggests that XRP remains positioned for significant long-term growth. Disclaimer : This content is meant to inform and should not be considered financial advice. The views expressed in this article may include the author’s personal opinions and do not represent Times Tabloid’s opinion. Readers are urged to do in-depth research before making any investment decisions. Any action taken by the reader is strictly at their own risk. Times Tabloid is not responsible for any financial losses. Follow us on X , Facebook , Telegram , and Google News The post Analyst Predicts Timelines For XRP Double and Triple Digit Prices appeared first on Times Tabloid .", "published_on": "2025-03-14T14:35:27", "url": "https://timestabloid.com/analyst-predicts-timelines-for-xrp-double-and-triple-digit-prices/", "source": "timestabloid", "categories": ["XRP", "TRADING", "MARKET", "RESEARCH"], "sentiment": {"polarity": 0.0799298366689671, "subjectivity": 0.43221647112951467, "sentiment": "neutral"}, "entities": ["ripple"], "topics": ["wave", "egrag", "potential", "could"]}, {"id": "41632096", "title": "$2 Million Crypto Fraud: AML Bitcoin Creator Guilty of Wire Fraud", "body": "The founder of AML Bitcoin (ABTC), Rowland Marcus Andrade , has been found guilty of wire fraud and money laundering .", "published_on": "2025-03-14T14:34:49", "url": "https://www.bitdegree.org/crypto/news/2-million-crypto-fraud-aml-bitcoin-creator-guilty-of-wire-fraud", "source": "bitdegree", "categories": ["BTC", "REGULATION"], "sentiment": {"polarity": -0.5, "subjectivity": 1.0, "sentiment": "negative"}, "entities": ["bitcoin"], "topics": ["fraud", "guilty", "wire", "million"]}, {"id": "41631163", "title": "Crypto News: Trump Administration Set to Focus on U.S.-Based Altcoins, Expert Reveals Bullish Outlook", "body": "The post Crypto News: Trump Administration Set to Focus on U.S.-Based Altcoins, Expert Reveals Bullish Outlook appeared first on Coinpedia Fintech News Andrew Lunardi, Head of Growth at Immutable, expressed strong optimism about the cryptocurrency market, predicting a substantial rebound in the second half of 2025. The cryptocurrency market is currently experiencing a slump, with Bitcoin and Ethereum trading below $82k and $2k respectively. One of the major catalysts, according to Lunardi, is the anticipated regulatory clarity from the Trump Administration. On the Milk Road podcast, he said that the administration’s forthcoming policies on compliant tokens will likely unlock substantial investment, particularly from institutional investors. “We’re about to see clear regulatory guidelines on what it means to have a compliant token, which will reduce risks and encourage more institutional capital to flow into the market,” Lunardi said. Lunardi also pointed to the fading prominence of meme coins as a bullish indicator. While many have seen the decline of meme coins as a sign of a bear market, Lunardi views it as a positive shift, suggesting that liquidity from meme coins will likely be reallocated into more established altcoins, potentially benefiting diverse crypto portfolios. Furthermore, Lunardi said that institutional capital inflows and the rise of exchange-traded funds (ETFs) will provide significant support to the market, helping to stabilize prices and facilitate broader crypto adoption. “The infrastructure for institutional capital is in place, with more ETFs opening up the market,” he explained. He explained that his main focus is on Bitcoin, and he remains bullish on Solana as well, despite the current popularity of meme coins. He also mentioned that he believes the Trump Administration will pay special attention to U.S.-based cryptocurrencies, particularly those that have utility and real-world applications. Despite his bullish outlook, Lunardi acknowledged the potential challenges posed by macroeconomic factors, such as tariffs and inflation. He warned that global economic uncertainties could still impact the crypto market in the short term, particularly if tariffs escalate and inflation remains high.", "published_on": "2025-03-14T14:32:10", "url": "https://coinpedia.org/news/crypto-news-trump-administration-set-to-focus-on-u-s-based-altcoins-expert-reveals-bullish-outlook/", "source": "coinpedia", "categories": ["TRADING", "ALTCOIN", "MARKET", "BTC", "BUSINESS"], "sentiment": {"polarity": 0.16087065233616957, "subjectivity": 0.47868562472010756, "sentiment": "positive"}, "entities": ["bitcoin", "ethereum", "solana"], "topics": ["lunardi", "administration", "trump", "institutional", "meme"]}, {"id": "41631144", "title": "Crypto Pundit Claims XRP Will Hit $1,000 – Here’s The 10 Reasons Why", "body": "In a new video, CryptoSensei (@Crypt0Senseii)—the founder of the Cryptonairz community—laid out a comprehensive argument for why he believes XRP could soar to four- and even five-digit price territory. The video, titled “THIS WILL GUARANTEE A $1000 XRP PRICE,” focuses on ten key factors that, according to CryptoSensei, could significantly boost XRP’s adoption and market valuation in the coming years. #1 Regulatory Clarity For XRP CryptoSensei begins by underscoring the ongoing legal situation involving the US Securities and Exchange Commission (SEC) and Ripple Labs, mentioning the partial appeal of the court’s July 2023 ruling. While stressing that the appeal does not designate XRP itself as a security, he notes that “we still have the case against Brad and Chris [referring to Ripple executives] going.” The resolution of these legal hurdles, he argues, is crucial for broader institutional adoption within the United States. “If we want the type of movement we’re looking for inside the US, we need those things to come to an end,” CryptoSensei says, alluding to the potential for major banks like Bank of America, Wells Fargo, and BNY Mellon to officially engage with XRP once regulatory clarity is achieved. #2 Institutions Standing By To Use XRP The video highlights a series of statements from major financial institutions, including the CEO of BNY Mellon, who indicated that crypto custody and tokenized assets are among the bank’s future priorities. According to CryptoSensei, banks are “ready to jump in,” but are hesitant to make large-scale commitments without clear regulatory guidelines. He emphasizes that if XRP were to host “even 5 or 10%” of a multi-trillion-dollar global tokenization market, the price could reach four- or five-digit figures. #3 Potential SEC Case Drops A noteworthy discussion point is the SEC’s recent trend of dropping cases (or opting not to pursue them) against certain crypto firms. CryptoSensei mentions that the Commission “dropped the case against OpenSea, Coinbase, [and] Robinhood,” suggesting a possible shift in enforcement strategy. “Is Ripple, in fact, next? … If the [former] Trump administration wants to stand by their word of working with the crypto industry and not against them, I do believe this is coming,” he posits. #4 Tokenization Of Real-World Assets (RWAs) Central to CryptoSensei’s thesis is the growing trend of tokenizing traditional assets—ranging from real estate to debt instruments—on blockchain networks. He cites Ripple Chief Technology Officer David Schwartz, who says the XRP Ledger (XRPL) could be “a really good platform” for these tokenization projects, thanks to its low fees, integrated decentralized exchange (DEX), and multi-asset support. Schwartz explained: “If someone’s going to buy or sell tokenized real-world assets, they want to be able to do that with whatever asset is convenient for them.” CryptoSensei further highlights how Robinhood’s documentation from January 2025 (mentioned in the video) cites Ripple’s success in tokenizing hundreds of millions of dollars in real-world assets on the XRPL—projects that aim to expand into the billions and eventually trillions. #5 Interoperability Bridges Another critical piece is interoperability. CryptoSensei references the Axelar network, which is bridging the XRPL mainnet, the XRP Ledger EVM sidechain, and over 55 other blockchains. The expansion of cross-chain liquidity is described as “liquidity, liquidity, liquidity.” He points out that the XRPL’s design—integrating DEX functionality directly into the protocol—simplifies asset swaps and liquidity provisioning, boosting its appeal for large-scale tokenization. #6 Cross-Border Payment Solutions Ripple’s long-standing focus on remittances and cross-border payments also features prominently. CryptoSensei shows a clip describing how a US-to-Mexico corridor, facilitated by XRP, can settle in mere minutes at a fraction of legacy fees. “All of that takes about 10 minutes, which used to be three days,” says a Ripple spokesperson in the included clip, also noting that these transactions can be up to “20-odd basis points cheaper.” He argues that such improvements in speed and cost will eventually outcompete outdated correspondent banking rails, potentially capturing a significant portion of the multi-billion-dollar global remittance market. #7 Collaborations With Key Global Institutions In the video, CryptoSensei showcases the Bank for International Settlements’ (BIS) Cross-Border Payments Interoperability and Extension Task Force, listing Ripple alongside only a handful of major international payment networks—such as Mastercard, SWIFT, and EBA Clearing. He emphasizes Ripple’s unique position as the only blockchain infrastructure provider on the roster, describing it as a testament to the company’s significance in shaping next-generation payment standards. #8 Treasury Market On XRP Ledger Referencing Ondo’s tokenization initiatives, CryptoSensei highlights the possibility of US Treasuries migrating onto blockchains, potentially including the XRP Ledger. He notes the US Treasury market alone stands at over $28 trillion, while globally, the bond market encompasses roughly $130 trillion. “Could you imagine five or ten trillion dollars finding its way onto the XRP Ledger over the next five to ten years?” he asks, suggesting even a fraction of that capital would profoundly affect XRP’s valuation. #9 Derivatives Expansion According to the video, derivatives—often said to represent notional values in the hundreds of trillions to over a quadrillion dollars—are a prime target for on-chain tokenization. CryptoSensei points to Bitstamp, which is building a derivatives exchange on the XRPL. He believes that capturing a slice of these massive markets could drive significant demand for XRP, especially if large holders lock up tokens for long-term liquidity provisioning. #10 Central Bank Digital Currencies (CBDCs) Finally, the pundit underscores Ripple’s work with various central banks on CBDC pilots. He cites projects under the Hong Kong Monetary Authority (HKMA) and notes that Ripple was recently named the top technology provider for CBDCs by Juniper Research. From the Bank of International Settlements to major economies in Asia, CryptoSensei posits that the institutional relationships Ripple has forged place XRP in a strategic position to bridge disparate currencies and networks. “Ripple is working with up to 30 central banks,” he states, emphasizing that these ongoing partnerships may open doors for XRP to serve as a liquidity tool in sovereign-level digital currencies. While some of the claims—such as XRP reaching “four or five digits”—are extremely bullish and hinge on multiple converging factors, CryptoSensei remains steadfast: if even a few of these catalysts unfold in Ripple’s favor, he envisions a drastically higher valuation for XRP. Throughout the video, he stresses that regulatory clarity in the United States is the linchpin to unlocking widespread adoption. “If all of these things happen,” he concludes, “you better believe we’re looking at a four to five digit price.” At press time, XRP traded at $2.31. Featured image created with DALL.E, chart from TradingView.com", "published_on": "2025-03-14T14:30:49", "url": "https://www.newsbtc.com/xrp-news/crypto-pundit-xrp-will-hit-1000-10-reasons/", "source": "newsbtc", "categories": ["XRP", "MARKET", "REGULATION", "FIAT", "WALLET"], "sentiment": {"polarity": 0.07175992731548288, "subjectivity": 0.4678985623430067, "sentiment": "neutral"}, "entities": ["ripple"], "topics": ["cryptosensei", "ripple", "bank", "video"]}, {"id": "41631140", "title": "Santiment: Weakening Trading Volume May Signal Slowing Market Momentum", "body": "A market intelligence platform has attributed the drop in crypto-wide trading volume since Feb. 27 to “exhaustion, hopelessness, and capitulation.” ‘Diminishing Trader Enthusiasm’ According to Santiment, a market intelligence platform, the drop in crypto-wide trading volume since Feb. 27 can be attributed to a combination of “exhaustion, hopelessness and capitulation.” Santiment adds the consistent decline", "published_on": "2025-03-14T14:30:21", "url": "https://news.bitcoin.com/santiment-weakening-trading-volume-may-signal-slowing-market-momentum/", "source": "bitcoin.com", "categories": ["MARKET", "TRADING"], "sentiment": {"polarity": 0.25, "subjectivity": 0.25, "sentiment": "positive"}, "entities": [], "topics": ["santiment", "volume", "intelligence", "platform", "attributed"]}, {"id": "41631197", "title": "XRP Primed for a Massive Breakout—What It Means for PEPE & DURAG!", "body": "Ripple (XRP) is about to break out and analysts are pointing to key technicals and momentum. As one of the top altcoins, price action often moves the entire crypto market. This is happening when memecoins like Pepe (PEPE) and DuragDoge ($DURAG) are still hot. If XRP breaks out it will bring in more liquidity and speculation across the altcoin space. Memecoins, known for their volatility and hype driven rallies, will see huge gains as traders rotate into them. Let’s get into what’s driving the impending XRP breakout and its impact on PEPE and DuragDoge. Ripple (XRP): On the Verge of Massive Breakout Amid SEC Challenges XRP moved recently after what seemed like an eternity of sideways grinding. Even experienced traders might become confused when an asset moves in such a manner. The problem is that experienced chart observers look at more than price movement. The Relative Strength Index (RSI), which they are tracking, currently provides an intriguing narrative. According to a new perspective from Matrixport, a well-known brand in digital asset management, an RSI hovering around 40% is frequently an indication that a rally may be about to begin. And you know what? The value of XRP is hovering around that threshold. However, Matrixport’s analysts believe that the SEC v. Ripple legal dispute will continue to dominate XRP’s future. The financial watchdog recently deleted the civil lawsuits it had filed against the cryptocurrency startup from its database. The long-running lawsuit may be coming to a close, or at the very least, it may be revisited, according to several members of the XRP community. Pepe (PEPE): Good Time to Invest or Hold Off? Pepe Coin has acquired significant traction in the memecoin market as one of the top altcoins. Unlike other memecoins, Pepe coin started as an entertaining online culture driven project. The coin is highly influenced by meme culture, which, as we all know, is the reason why so many cryptocurrencies are popular today. When the price of Pepe rose significantly, serious investors and crypto enthusiasts paid attention to it; wondering how far this meme could stretch. The upcoming breakout of XRP stands a chance of positively affecting memecoins such as Pepe. It is clear from Pepecoin’s price nowadays that the coin has done well, but the question is, will its price continue to rise? Market trends, active members within the community, and memes that serve as advertisement influence the price of Pepe Coin significantly. Because of the coin’s vast and loyal following, analysts believe Pepe’s price might have a good few months ahead of it. DuragDoge ($DURAG): The Ultimate Memecoin with Style and Swagger People understand that anytime a cryptocurrency with a large market size, for instance XRP, experiences a breakout, this means new liquidity is available in the market. Seeing profits from XRP, investors can reinvest into high-potential altcoins, including memecoins like $DURAG. This new money can increase trading volume and therefore set price appreciation for the token. DuragDoge is not a copycat, it’s the rush of street life and the fun of memecoin. The project promises to rewrite the script and bring something new and real even as it acknowledges the meme currency market is full of copycats and overhyped promises. The objective is to create a community driven by the drip, driven by aspiration, and powered by cryptocurrency. Known as a swagger coin, DuragDoge is designed for the street to reward people who “work hard, show off, and don’t hesitate to take risks.” With $DURAG as its badge of honour, the initiative keeps true to this narrative by building a bold, inventive community that always shows off the hustle. For those who believe in their glow up, Durag Doge is a lifestyle, a silky durag and powered by the hood’s energy, street smarts and swag. Analysts say it’s one of the high-potential altcoins set for growth sooner than expected. Conclusion XRP is about to make a big move and its breakout will trigger a dominos effect in the altcoin market. Memecoins like PEPE and $DURAG will benefit if liquidity and speculation increases. PEPE and $DURAG will ride this wave and moon as traders look for the next big moonshot. Follow Durag Doge on X and Telegram for the latest news and updates. Visit Durag Doge Presale", "published_on": "2025-03-14T14:30:00", "url": "https://www.cryptopolitan.com/xrp-primed-for-a-massive-breakout-what-it-means-for-pepe-durag/", "source": "cryptopolitan", "categories": ["XRP", "TRADING", "PEPE", "MARKET", "ALTCOIN"], "sentiment": {"polarity": 0.17014994667168581, "subjectivity": 0.5205633979547022, "sentiment": "positive"}, "entities": ["ripple", "dogecoin"], "topics": ["pepe", "durag", "memecoins", "duragdoge"]}, {"id": "41631057", "title": "Bitcoin’s Critical Levels: Potential $596 Million Short Liquidation Looms as Price Tests $83,000 Resistance", "body": "On March 14th, COINOTAG reported significant data from Coinglass regarding the potential liquidation trends surrounding Bitcoin. Should Bitcoin surpass the $83,000 threshold, a staggering $596 million in cumulative short liquidations", "published_on": "2025-03-14T14:28:30", "url": "https://en.coinotag.com/breakingnews/bitcoins-critical-levels-potential-596-million-short-liquidation-looms-as-price-tests-83000-resistance/", "source": "coinotag", "categories": ["BTC", "TRADING"], "sentiment": {"polarity": 0.0625, "subjectivity": 0.7125, "sentiment": "neutral"}, "entities": ["bitcoin"], "topics": ["liquidation", "potential", "million", "short", "bitcoins"]}, {"id": "41630979", "title": "MEXC Lists AO (AO), Expanding Support for Decentralized Computing and AI Innovation with a 140,000 USDT Prize Pool", "body": "VICTORIA , Seychelles , March 14, 2025 /PRNewswire/ — MEXC, a leading global cryptocurrency trading platform, announces the listing of AO (AO) on both spot and futures markets, scheduled for March 14, 2025 , at 06:00 (UTC). To mark the occasion, MEXC is launching an Airdrop+ rewards event with a 140,000 USDT prize pool, providing users with multiple opportunities to engage with AO and explore its potential within the decentralized computing space. Unleashing AO: MEXC Supports the Future of Decentralized Computing and AI Agents AO is a decentralized ultra-parallel computing network that expands on-chain computation while ensuring all operations remain verifiable and permanently recorded. Built on Arweave’s permanent storage, AO features an actor-oriented architecture, where modular programs (actors) operate independently, select their own virtual machines (VMs), consensus mechanisms, and payment models, and communicate through a standardized messaging layer. With self-triggering execution and autonomous agent capabilities, AO enables efficient DeFi strategies, automated DEX trading, and AI-driven applications, unlocking a new era of decentralized computing. By listing AO , MEXC reinforces its commitment to supporting cutting-edge innovations at the intersection of AI, blockchain infrastructure, and decentralized computing. As demand for on-chain processing and AI-powered applications grows, MEXC provides AO with critical market access, deep liquidity, and an engaged global user base to accelerate its adoption and utility. Beyond just a listing, MEXC plays a crucial role in fostering the adoption and development of innovative blockchain projects across AI and DePIN. With a strong trading community, strategic marketing initiatives, and a track record of launching high-potential assets, MEXC provides projects like AO with the tools to gain visibility and traction within the crypto ecosystem. Through this listing, MEXC continues to connect users with the latest blockchain advancements, ensuring accessibility to next-generation decentralized infrastructure. Celebrate AO’s Listing with a 140,000 USDT Prize Pool MEXC, known for quickly listing trending tokens, expands its offerings with AO (AO). The AO/USDT trading market officially launched in the Innovation Zone on March 14, 2025 , at 06:00 (UTC), followed by the introduction of the AO USDT perpetual futures at 06:10 (UTC), offering adjustable leverage from 1x to 50x with both cross and isolated margin modes. To celebrate the listing of AO (AO) on MEXC Spot and Futures , MEXC is launching a series of exclusive events from March 13, 2025 , at 12:00 (UTC) – March 23, 2025 , at 10:00 (UTC) , giving both new and existing users the opportunity to earn USDT bonuses and other rewards while engaging with the AO ecosystem. Event 1: Deposit to Share 72,000 USDT (New User Exclusive) New users who trade AO spot (≥ $100 ) or futures (≥ $500 ) can earn a 30 USDT bonus, with a total of 72,000 USDT up for grabs. Event 2: Futures Challenge — Trade to Share 50,000 USDT in Futures Bonuses (Open to All Users) Each user can receive up to 5,000 USDT in Futures bonuses. Event 3: Invite New Users & Share 18,000 USDT (Open to All Users) Event 4: Spread the Word and Win Rewards Your Easiest Way to Trending Tokens MEXC aims to become the go-to platform offering the widest range of valuable crypto assets. The platform has grown its user base to 34 million by offering a diverse selection of tokens, high-frequency airdrops, competitive fees, and comprehensive liquidity . In 2024, MEXC launched a total of 2,376 new tokens, including 1,716 initial listings and 605 memecoins, with total airdrop rewards exceeding $136 million . About MEXC Founded in 2018, MEXC is committed to being “Your Easiest Way to Crypto”. Serving over 34 million users across 170+ countries, MEXC is known for its broad selection of trending tokens, frequent airdrop opportunities, and low trading fees. Our user-friendly platform is designed to support both new traders and experienced investors, offering secure and efficient access to digital assets. MEXC prioritizes simplicity and innovation, making crypto trading more accessible and rewarding. MEXC Official Website ｜ X ｜ Telegram ｜ How to Sign Up on MEXC", "published_on": "2025-03-14T14:27:35", "url": "https://bitcoinworld.co.in/mexc-lists-ao-ao-expanding-support-for-decentralized-computing-and-ai-innovation-with-a-140000-usdt-prize-pool/", "source": "bitcoinworld", "categories": ["USDT", "TRADING", "AIRDROP", "BLOCKCHAIN", "MARKET"], "sentiment": {"polarity": 0.14053891184573003, "subjectivity": 0.5165375344352617, "sentiment": "positive"}, "entities": [], "topics": ["mexc", "user", "usdt", "listing"]}, {"id": "41630905", "title": "Three Arrows Capital Liquidators Seek Increased Claim Against FTX, Now Valued at $1.53 Billion", "body": "The ongoing legal battles between liquidators of Three Arrows Capital (3AC) and FTX highlight the complexities of bankruptcy proceedings in the crypto sector. The US bankruptcy court’s decision to allow", "published_on": "2025-03-14T14:23:43", "url": "https://en.coinotag.com/three-arrows-capital-liquidators-seek-increased-claim-against-ftx-now-valued-at-1-53-billion/", "source": "coinotag", "categories": ["FTT", "REGULATION"], "sentiment": {"polarity": 0.2, "subjectivity": 0.2, "sentiment": "positive"}, "entities": [], "topics": ["three", "arrow", "capital", "liquidator"]}, {"id": "41630792", "title": "XRP Dominates Korean Market with 29.93% Trading Volume Surge on Upbit", "body": "According to data from CoinGecko, reported on March 14th, Upbit has achieved an impressive trading volume of $21.1 billion within the last 24 hours. This surge highlights the platform’s significant", "published_on": "2025-03-14T14:22:29", "url": "https://en.coinotag.com/breakingnews/xrp-dominates-korean-market-with-29-93-trading-volume-surge-on-upbit/", "source": "coinotag", "categories": ["XRP", "EXCHANGE", "TRADING", "MARKET"], "sentiment": {"polarity": 0.4583333333333333, "subjectivity": 0.6472222222222223, "sentiment": "positive"}, "entities": ["ripple"], "topics": ["volume", "surge", "upbit", "dominates"]}, {"id": "41630640", "title": "Altcoin Season 2025: Key Insights & Top Coins to Consider", "body": "The post Altcoin Season 2025: Key Insights & Top Coins to Consider appeared first on Coinpedia Fintech News The total cryptocurrency market cap has lost more than $1 trillion in the past three months, causing intensified panic selling. The notable bleeding of major stock indexes has trickled down into the crypto market, as Bitcoin price slipped from trading above $101k to around $82k on Thursday, March 13, during the early New York trading session. The altcoin market has recorded the highest losses in the past few months, led by Ethereum (ETH), and Dogecoin (DOGE). As a result, the question lingering in most crypto traders is when and if an altseason will happen in 2025. Altseason 2025 Key Insights From historical data, the altcoin season has been kickstarted by the reversal of the macro Bitcoin dominance. However, the introduction of spot crypto ETFs has significantly disrupted the historical crypto cash rotation, thus complicating the expected timeline of the altseason 2025. From a technical analysis perspective, the Others/BTC pair in the weekly timeframe is currently retesting a crucial support level, which in the past cycles yielded parabolic altseason. However, the altseason will be delayed if the altcoin market fails to rebound from the current levels in the coming weeks. #Altseason is Ready To Go $Total 2 is showing the same ready-to-go pattern for Altseason. The RSI is in the neutral zone, poised for a breakout to the overbought zone during the upcoming Altseason pic.twitter.com/5iLM0iOUTb — Trader Tardigrade (@TATrader_Alan) March 13, 2025 .article-inside-link { margin-left: 0 !important; border: 1px solid #0052CC4D; border-left: 0; border-right: 0; padding: 10px 0; text-align: left; } .entry ul.article-inside-link li { font-size: 14px; line-height: 21px; font-weight: 600; list-style-type: none; margin-bottom: 0; display: inline-block; } .entry ul.article-inside-link li:last-child { display: none; } Also Read : Crypto News Today, 14th March : Pi Network Price , XRP News, Bitcoin & Ethereum Price Today , Top Alts to Consider The existence of more than 15k altcoins, both utility and memecoins, has heavily diluted the existing crypto liquidity, thus slowing down historical four-year crypto bull cycles. However, the administration change in the United States under President Donald Trump, which has significantly focused on providing clear crypto regulations, has favored a rejuvenated mainstream adoption of digital assets , led by DeFi tokens. The launch of the Official Trump (TRUMP) memecoin has heavily democratized the adoption of crypto assets by retail and institutional investors. Considering all the factors, top altcoins to keep a close watch on in the anticipated altseason include the heavily oversold tokens, especially those with robust leadership and a supportive online community. For instance, Shiba Inu (SHIB), Notcoin (NOT), Litecoin (LTC), Toncoin (TON), PancakeSwap (CAKE), and Uniswap (UNI). .article_register_shortcode { padding: 18px 24px; border-radius: 8px; display: flex; align-items: center; margin: 6px 0 22px; border: 1px solid #0052CC4D; background: linear-gradient(90deg, rgba(255, 255, 255, 0.1) 0%, rgba(0, 82, 204, 0.1) 100%); } .article_register_shortcode .media-body h5 { color: #000000; font-weight: 600; font-size: 20px; line-height: 22px; text-align:left; } .article_register_shortcode .media-body h5 span { color: #0052CC; } .article_register_shortcode .media-body p { font-weight: 400; font-size: 14px; line-height: 22px; color: #171717B2; margin-top: 4px; text-align:left; } .article_register_shortcode .media-body{ padding-right: 14px; } .article_register_shortcode .media-button a { float: right; } .article_register_shortcode .primary-button img{ vertical-align: middle; width: 20px; margin: 0; display: inline-block; } @media (min-width: 581px) and (max-width: 991px) { .article_register_shortcode .media-body p { margin-bottom: 0; } } @media (max-width: 580px) { .article_register_shortcode { display: block; padding: 20px; } .article_register_shortcode img { max-width: 50px; } .article_register_shortcode .media-body h5 { font-size: 16px; } .article_register_shortcode .media-body { margin-left: 0px; } .article_register_shortcode .media-body p { font-size: 13px; line-height: 20px; margin-top: 6px; margin-bottom: 14px; } .article_register_shortcode .media-button a { float: unset; } .article_register_shortcode .secondary-button { margin-bottom: 0; } } Never Miss a Beat in the Crypto World! Stay ahead with breaking news, expert analysis, and real-time updates on the latest trends in Bitcoin, altcoins, DeFi, NFTs, and more. .subscription-options li { display: none; } .research-report-subscribe{ background-color: #0052CC; padding: 12px 20px; border-radius: 8px; color: #fff; font-weight: 500; font-size: 14px; width: 96%; } .research-report-subscribe img{ vertical-align: sub; margin-right: 2px; } Subscribe to Price Analysis var templateIds = \"6\"; var listOfSubscribed = []; function subscribed_popupmodal(template_id) { var templateId = '6'; getAllSubscriberCategoryList([templateId]); var subcribemodal = window.parent.document.getElementById('subscribe-modal-design'); if (subcribemodal) { var modalContent = ` Never Miss a Beat in the Crypto World! Stay informed and gain the edge you need to navigate the crypto world. Select your subscription now Daily Get real-time crypto news, market insights, and blockchain updates. Weekly Stay updated with major trends, funding news, and price analysis. Monthly Receive a detailed report with market analysis and expert predictions. Subscribe Now `; subcribemodal.innerHTML = modalContent; } subscribe_unsubscribe_status(template_id); //getAllSubscriberCategoryList(template_id); } function toggleSubscription(subscription, template_id) { var subscriptionCheckbox = document.getElementById(subscription + '_' + template_id); var li = document.getElementById(subscription + 'Selected_' + template_id); if (subscriptionCheckbox.checked) { li.classList.add('active'); } else { li.classList.remove('active'); } } function getAllSubscriberCategoryList(getcategoryId) { jQuery.ajax({ url: 'https://coinpedia.org/wp-admin/admin-ajax.php', type: 'GET', data: { action: 'subscribe_api_ajax_request', apiurl: '/app/email_newsletter/list', }, success: function(response) { var result = JSON.parse(response.message); if (result.status === true) { var idstosubscribed = [] // Populate listOfSubscribed with subscribed category IDs result.message.forEach(listofcategory => { if (listofcategory.subscribe_status === 1) { if (!listOfSubscribed.includes(listofcategory._id)) { listOfSubscribed.push(listofcategory._id); } if (!idstosubscribed.includes(listofcategory.news_cp_category_row_id)) { idstosubscribed.push(listofcategory.news_cp_category_row_id); } } }); idstosubscribed.forEach(id => { var subscribeButton = document.getElementById('subscribe_' + id); var unsubscribeButton = document.getElementById('unsubscribe_' + id); if (subscribeButton && unsubscribeButton) { subscribeButton.style.display = 'none'; unsubscribeButton.style.display = 'block'; var showDownloadReport = document.getElementById('download_report'); if (showDownloadReport) { showDownloadReport.style.display = 'block'; } } }); } }, error: function(xhr, status, error) { console.error('Error:', error); } }); } function subscribe_unsubscribe_status(getcategoryId) { var elementTounsubscribe = parent.document.getElementById('unsubscribe_' + getcategoryId); var elementTosubscribe = parent.document.getElementById('subscribe_' + getcategoryId); jQuery.ajax({ url: 'https://coinpedia.org/wp-admin/admin-ajax.php', type: 'POST', data: { action: 'subscribe_api_ajax_request', apiurl: '/app/email_newsletter/list?category_row_id=' + getcategoryId, }, success: function(response) { var result = JSON.parse(response.message); if (result.status === true) { parent.jQuery('.skeliton-loader-block').hide(); var hasSubscribeStatusOne = false; result.message.forEach(subscribeStatus => { if (listOfSubscribed.includes(subscribeStatus._id) && subscribeStatus.subscribe_status === 1) { hasSubscribeStatusOne = true; } if (subscribeStatus.notification_type === 3) { parent.document.getElementById('monthlySelected_' + getcategoryId).style.display = 'block'; parent.document.getElementById('monthly_' + getcategoryId).setAttribute('data-id', subscribeStatus._id); if (subscribeStatus.subscribe_status === 1) { parent.document.getElementById('monthly_' + getcategoryId).checked = true; } } else if (subscribeStatus.notification_type === 2) { parent.document.getElementById('weeklySelected_' + getcategoryId).style.display = 'block'; parent.document.getElementById('weekly_' + getcategoryId).setAttribute('data-id', subscribeStatus._id); if (subscribeStatus.subscribe_status === 1) { parent.document.getElementById('weekly_' + getcategoryId).checked = true; } } else if (subscribeStatus.notification_type === 1) { parent.document.getElementById('dailySelected_' + getcategoryId).style.display = 'block'; parent.document.getElementById('daily_' + getcategoryId).setAttribute('data-id', subscribeStatus._id); if (subscribeStatus.subscribe_status === 1) { parent.document.getElementById('daily_' + getcategoryId).checked = true; } } if (subscribeStatus.subscribe_status === 1) { listOfSubscribed.push(subscribeStatus._id); } }); if (hasSubscribeStatusOne) { elementTosubscribe.style.display = 'none'; elementTounsubscribe.style.display = 'block'; } else { elementTosubscribe.style.display = 'block'; elementTounsubscribe.style.display = 'none'; } } }, error: function(xhr, status, error) { console.error('Error:', error); } }); } function logSelectedSubscriptions(categoryid) { var unsubscribemodal = document.querySelector('.unsubscribed-popup-modal .modal'); var subscribedmodal = document.querySelector('.subscribed-popup-modal .modal'); unsubscribemodal.innerHTML=''; subscribedmodal.innerHTML=''; var selectedSubscriptions = []; var storeCheckedId = []; var checkboxes = document.querySelectorAll('#subscription-options-' + categoryid + ' input[type=\"checkbox\"]'); var errorMessage = document.getElementById('error-message-select'); // Use a Set to handle unique data-ids var uniqueSubscribedIds = new Set(listOfSubscribed); checkboxes.forEach(function(checkbox) { var dataId = parseInt(checkbox.getAttribute('data-id')); if (checkbox.checked) { selectedSubscriptions.push(checkbox.id); storeCheckedId.push(dataId); } else { uniqueSubscribedIds.delete(dataId); // Remove unchecked data-id } }); // Update listOfSubscribed with unique values listOfSubscribed = Array.from(uniqueSubscribedIds); var selectedSubscriptionsString = selectedSubscriptions.join(', '); var concatinateSubscribeId = [...new Set(storeCheckedId.concat(listOfSubscribed))]; var categoryData = { 'subscribed_categories': concatinateSubscribeId }; var requestSubscriberData = { action: 'handle_dynamic_api_request_with_headers', security: 'c4724085ee', endpoint: '/app/email_newsletter/update_categories', token: '', data: categoryData }; jQuery.ajax({ url: 'https://coinpedia.org/wp-admin/admin-ajax.php', type: 'POST', data: requestSubscriberData, beforeSend: function(xhr) { xhr.setRequestHeader('X-Requested-With', 'XMLHttpRequest'); }, success: function(response) { try { response = response.data; if (storeCheckedId.length === 0) { var unsubcribedPopUpmodal = ` You’ve Unsubscribed Successfully We're sorry to see you go! Your subscription has been canceled. If you change your mind, you can re-subscribe anytime. Thank you for being part of our community! `; unsubscribemodal.innerHTML = unsubcribedPopUpmodal; document.querySelector('#subscribe-modal-design .modal').style.display = 'none'; unsubscribemodal.style.display = 'block'; unsubscribemodal.classList.remove('hide'); unsubscribemodal.classList.add('show'); document.getElementById('subscribe_' + categoryid).style.display = 'block'; document.getElementById('unsubscribe_' + categoryid).style.display = 'none'; var showDownloadReport = document.getElementById('download_report'); if (showDownloadReport) { showDownloadReport.style.display = 'none'; } } else { var subscribedPopupModal = ` Thank you for subscribing! Thank you for subscribing to our crypto and blockchain newsletter! You’ll now receive the latest news, insights, and updates straight to your inbox. Welcome to our community! `; let selectedSubscriptionsArray = selectedSubscriptionsString.split(','); let subscribedCategories = selectedSubscriptionsArray.map(subscription => subscription.split('_')[0]); let subscribedCategoriesString = subscribedCategories.join(', '); subscribedmodal.innerHTML = subscribedPopupModal; if (document.getElementById('selectidname')) { document.getElementById('selectidname').textContent = subscribedCategoriesString; } document.querySelector('#subscribe-modal-design .modal').style.display = 'none'; subscribedmodal.style.display = 'block'; subscribedmodal.classList.remove('hide'); subscribedmodal.classList.add('show'); document.getElementById('subscribe_' + categoryid).style.display = 'none'; document.getElementById('unsubscribe_' + categoryid).style.display = 'block'; var showDownloadReport = document.getElementById('download_report'); if (showDownloadReport) { showDownloadReport.style.display = 'block'; } } } catch (e) { console.error('Error parsing response:', e); } }, }); } function closeModal(template_id) { var modalId = template_id; var modal = document.querySelector('#' + modalId); // Using querySelector to find the modal if (modal) { modal.classList.add('hide'); modal.classList.remove('show'); setTimeout(function() { modal.style.display = 'none'; }, 500); } else { console.warn('Modal not found:', modalId); } } function closeunsubscribemodal() { var unsubscribemodal = document.querySelector('.unsubscribed-popup-modal .modal'); if (unsubscribemodal) { unsubscribemodal.classList.add('hide'); unsubscribemodal.classList.remove('show'); } setTimeout(function() { unsubscribemodal.style.display = 'none'; }, 500); } function closesubscribemodal() { var subscribedmodal = document.querySelector('.subscribed-popup-modal .modal'); setTimeout(function() { subscribedmodal.style.display = 'none'; }, 500); if (subscribedmodal) { subscribedmodal.classList.add('hide'); subscribedmodal.classList.remove('show'); } } function withoutLoginClicked(withoutlogin_id) { localStorage.setItem('subscribe_without_Login', 'true'); localStorage.setItem('subscribe_clicked_id', withoutlogin_id); } document.addEventListener('DOMContentLoaded', function() { const subscribewithoutData = localStorage.getItem('subscribe_without_Login'); const subscribe_clicked_cat_id = localStorage.getItem('subscribe_clicked_id'); // Function to get cookies function getCookie(name) { let value = \"; \" + document.cookie; let parts = value.split(\"; \" + name + \"=\"); if (parts.length == 2) return parts.pop().split(\";\").shift(); } // Get user token from cookies const userToken = getCookie('user_token'); if (subscribewithoutData === 'true' && userToken) { // Call the modal function with the category ID subscribed_popupmodal(subscribe_clicked_cat_id); // Remove the flag and category ID from localStorage localStorage.removeItem('subscribe_without_Login'); localStorage.removeItem('subscribe_clicked_id'); } }); /************************** update susbcriber content **************************** */ function initializeSubscriptionButton() { var initialListItems = document.querySelectorAll('.subscription-options input[type=\"checkbox\"]'); initialListItems.forEach(function(item) { console.log(item.checked, 'Initial Checkbox checked status'); }); var listItems = document.querySelectorAll('.subscription-options li'); if (listItems.length === 0) return; var anyActive = false; listItems.forEach(function(item) { var checkbox = item.querySelector('input[type=\"checkbox\"]'); if (checkbox) { if (checkbox.checked) { item.classList.add('active'); anyActive = true; // Set anyActive to true } else { item.classList.remove('active'); // Remove 'active' class if checkbox is unchecked } } }); } function updateButtonText(anyActive) { var subscribeButtonSpan = document.querySelector('.subscribe-submit .changeBtnText'); if (subscribeButtonSpan) { if (anyActive) { subscribeButtonSpan.textContent = 'Subscribe Now'; } else { subscribeButtonSpan.textContent = 'Unsubscribe'; } } } function updateSubscriptionButton() { var listItems = document.querySelectorAll('.subscription-options li'); if (listItems.length === 0) return; var anyActive = false; listItems.forEach(function(item) { var checkbox = item.querySelector('input[type=\"checkbox\"]'); if (checkbox) { if (checkbox.checked) { item.classList.add('active'); anyActive = true; // Set anyActive to true } else { item.classList.remove('active'); // Remove 'active' class if checkbox is unchecked } } }); // Update the button text based on whether any list item has the 'active' class updateButtonText(anyActive); } document.addEventListener('click', function(event) { var clickedItem = event.target.closest('.subscription-options li'); if (clickedItem) { var checkbox = clickedItem.querySelector('input[type=\"checkbox\"]'); if (checkbox) { checkbox.checked = !checkbox.checked; updateSubscriptionButton(); } } }); FAQs Why is the crypto market crashing in 2025? Crypto lost $1T due to stock market declines, Bitcoin dropping to $82K, and investor panic, impacting altcoins like ETH and DOGE. Will crypto regulations impact Altseason? Clearer U.S. regulations under Trump may boost crypto adoption, favoring DeFi tokens and increasing investor confidence in altcoins.", "published_on": "2025-03-14T14:18:01", "url": "https://coinpedia.org/price-analysis/altcoin-season-2025-key-insights-top-coins-to-consider/", "source": "coinpedia", "categories": ["ALTCOIN", "MARKET", "TRADING", "SHIB", "BTC", "BUSINESS"], "sentiment": {"polarity": 0.09735872113997109, "subjectivity": 0.4918924963924964, "sentiment": "neutral"}, "entities": ["bitcoin", "ethereum", "ripple", "dogecoin", "shiba inu", "litecoin", "chainlink", "uniswap"], "topics": ["function", "article_register_shortcode", "none"]}, {"id": "41630759", "title": "US court gives Three Arrows nod to increase its FTX claim to $1.53B", "body": "A US bankruptcy court has authorized liquidators of defunct crypto hedge fund Three Arrows Capital (3AC) to increase their claim against collapsed crypto exchange FTX from $120 million to $1.53 billion. Chief Judge John Dorsey rejected FTX’s debtors’ argument that the amended proof of claim (POC) from 3AC liquidators was untimely and an unjust attempt to slow the bankruptcy proceedings. In a March 13 ruling in the US Bankruptcy Court for the District of Delaware, Dorsey opined that 3AC liquidators had provided sufficient notice of their claim and the possibility of amending it once they had analyzed all the available information. Any delay, he said, was caused by FTX’s failure to share relevant records promptly. Chief Judge John Dorsey has granted the motion by liquidators for defunct hedge fund Three Arrows Capital to increase their claim against FTX to $1.53 billion. Source: “The evidence suggests that the delay in filing the Amended Proof of Claim was, in large part, caused by the Debtors themselves,” Dorsey said. “The evidence also suggests that the Liquidators were diligent in attempting to obtain the information and that despite having the complete information in their possession, the Debtors repeatedly delayed giving it to them.” 3AC liquidators initially filed a $120 million claim in FTX’s bankruptcy case in June 2023. They later expanded it in November 2024 , alleging claims including breach of contract, unjust enrichment, and breach of fiduciary duty. The liquidators alleged FTX held $1.53 billion in the hedge fund assets that were liquidated to settle $1.33 billion in liabilities in 2022. They argued that the transactions were avoidable, caused harm to 3AC creditors and that FTX debtors had delayed providing the information that would have uncovered the liquidation. FTX debtors objected to the amended claim, saying that the original POC was insufficient to inform them about the nature and amount 3AC liquidators would be claiming and that it came too late and should be disallowed. Related: FTX filed for bankruptcy 2 years ago — What’s happening now? Before its collapse in June 2022 , Three Arrows Capital was once one of the industry’s largest crypto hedge funds, with over $3 billion in assets. Its liquidators also pursued claims against collapsed crypto firm Terraform Labs through a $1.3 billion claim in Terra’s bankruptcy case. At the same time, FTX, which filed for bankruptcy in November 2022, has been undertaking its own recovery efforts to reclaim funds. In November last year, it filed a trio of lawsuits, one against SkyBridge Capital and its founder, Anthony Scaramucci, to recoup funds spent by former FTX CEO Sam “SBF” Bankman-Fried on sponsorship and investment deals. Another suit was filed against crypto exchange Binance and its former CEO, Changpeng Zhao , to recover $1.76 billion worth of cryptocurrency sent to the exchange as part of a July 2021 repurchase deal. Waves founder Aleksandr Ivanov is also in the crosshairs for $80 million worth of crypto sent to the Waves-based decentralized liquidity protocol by Alameda Research in 2022. Magazine: Crypto fans are obsessed with longevity and biohacking: Here’s why", "published_on": "2025-03-14T14:17:09", "url": "https://cointelegraph.com/news/us-bankruptcy-court-nods-three-arrow-bid-increase-claim-against-ftx?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "source": "cointelegraph", "categories": ["EXCHANGE", "LUNA", "BLOCKCHAIN", "BNB", "RESEARCH"], "sentiment": {"polarity": 0.039664502164502166, "subjectivity": 0.3441017316017316, "sentiment": "neutral"}, "entities": [], "topics": ["claim", "liquidator", "bankruptcy", "billion"]}, {"id": "41631126", "title": "Finance Expert Says Institutions Will Diversify From Bitcoin into XRP. Here’s why", "body": "A financial expert has argued that institutions would expand their crypto investment strategies beyond Bitcoin and Ethereum by adding XRP ETFs to their portfolios. This perspective follows Franklin Templeton’s recent filing for an XRP exchange-traded fund (ETF) , bringing the total number of proposed XRP ETFs to 15. Linda P. Jones, author of the finance book, “3 Steps to Quantum Wealth” emphasized this shift, suggesting that institutional investors will look beyond Bitcoin and Ethereum as market dynamics evolve. She contends that recent market trends, including XRP’s strong performance relative to Bitcoin and Ethereum, indicate growing interest in the asset. A Record Number of XRP ETF Filings Franklin Templeton’s move to file for an XRP ETF has set a new benchmark, with XRP now leading all other cryptocurrencies in ETF filings. The total of 15 proposed XRP ETFs surpasses the number of filings for Bitcoin, which stands at 11, and Ethereum, which has seen only 8 filings. Some see the surge in ETF applications as an indication of strong demand for institutional XRP investment products. Bitwise CIO Matt Hougan supported this view, stating last month that there is substantial interest in XRP-based investment vehicles. We are on twitter, follow us to connect with us :- @TimesTabloid1 — TimesTabloid (@TimesTabloid1) July 15, 2023 Skepticism Over Demand Despite the increasing XRP ETF applications, skepticism remains regarding whether these products will attract significant investor interest. Scott Melker, host of The Wolf of All Streets, pointed out that the cryptocurrency market has seen a growing number of ETF filings. He suggested that while he is not opposed to this trend, investors might not immediately purchase these products upon their approval. Melker’s comments reflect broader concerns about demand for crypto ETFs outside Bitcoin. For instance, Ethereum ETFs, launched in July 2024, have experienced relatively low adoption compared to Bitcoin. Since January 2024, Bitcoin ETFs have recorded $35.4 billion in net inflows, while Ethereum ETFs have only seen $2.63 billion since their introduction. Institutional Interest in XRP ETFs In response to Melker’s doubts, Jones reaffirmed her belief that institutions will diversify beyond Bitcoin and Ethereum, incorporating XRP ETFs into their investment strategies. She noted that XRP has outperformed Bitcoin by 212% since November 2023 and has gained approximately 250% against Ethereum within the same period. “Institutions will diversify out of Bitcoin/Eth only and add XRP ETFs to their portfolio,” Jones stated , reinforcing her position that institutional investors will embrace XRP ETF products upon launch. Additionally, proponents argue that asset managers do not typically file for ETFs unless there is market demand. Franklin Templeton’s filing and applications from other asset managers suggest that there is already interest in such products. Leading Firms Pursuing XRP ETFs Besides Franklin Templeton, other notable asset managers who have applied for XRP ETFs include Grayscale, 21Shares, Bitwise, and Canary Capital. ProShares and Volatility Shares have each submitted filings for three XRP ETFs, while Hashdex and Purpose Investments have proposed non-U.S. versions. Some reports have claimed that VanEck, Fidelity, Galaxy Digital, and Invesco have also filed for XRP ETFs. However, these claims are unverified. With the growing number of XRP ETF filings and increasing discussions surrounding institutional adoption, market analysts continue to assess whether XRP investment products will gain traction similar to Bitcoin ETFs. While skepticism persists, the rising interest from major asset managers suggests that XRP ETFs could soon play a more prominent role in institutional portfolios. Disclaimer : This content is meant to inform and should not be considered financial advice. The views expressed in this article may include the author’s personal opinions and do not represent Times Tabloid’s opinion. Readers are urged to do in-depth research before making any investment decisions. Any action taken by the reader is strictly at their own risk. Times Tabloid is not responsible for any financial losses. Follow us on X , Facebook , Telegram , and Google News The post Finance Expert Says Institutions Will Diversify From Bitcoin into XRP. Here’s why appeared first on Times Tabloid .", "published_on": "2025-03-14T14:12:15", "url": "https://timestabloid.com/finance-expert-says-institutions-will-diversify-from-bitcoin-into-xrp-heres-why/", "source": "timestabloid", "categories": ["XRP", "BTC", "ETH", "MARKET", "BUSINESS"], "sentiment": {"polarity": 0.10260167464114833, "subjectivity": 0.4512161084529506, "sentiment": "positive"}, "entities": ["bitcoin", "ethereum", "ripple"], "topics": ["filing", "investment", "institutional"]}, {"id": "41630468", "title": "AI's Lead Over Crypto for VC Dollars Increased in Q1'25, But Does This Race Really Matter?", "body": "Crypto venture funding in the U.S. clocked in at approximately $861 million for the first three months of 2025, but was dwarfed by artificial intelligence's nearly $20 billion haul, according to data provided by Pitchbook, showing how investors continue to show preference to AI. Data shows that investors closed 795 deals in the U.S in AI from January to March, with blockbuster deals like Databricks' $15.3 billion round and Anthropic's $2 billion raise dominating headlines. Crypto's largest blockbuster deal, in comparison, was Abu Dhabi's MGX, with a $2 billion investment into Binance – the first institutional placement in the crypto exchange. Other deals of note include a $82 million raise from payment infrastructure company Mesh, ETF issuer Bitwise's $70 million round, and digital asset bank Sygnum's $58 million offering. Prior reporting by Pitchbook shows that AI startups attracted one-third of global VC investment in 2024, totaling $131.5 billion, with nearly a quarter of new startups being an AI company across 4,318 VC deals, compared to crypto's $4.9 billion across just 706 deals. Analysis: Has AI stolen crypto's venture dollars? Blockbuster rounds from VCs in the AI space and headline-grabbing antics, such as OpenAI's Sam Altman seeking trillions , and AI's rise from technological novelty to household name thanks to transformer models , would make one think that there's suddenly an investor preference for one over the other. Historically, all data shows that VCs have generally favored AI over crypto, with AI and machine learning attracting consistent funding that's expanded exponentially, according to Statista data , growing from $670 million in 2011 to $36 billion in 2020 and only upwards from there. There's only been one year where crypto beat AI for funding, which was 2021 when VCs poured $30 billion into the market compared to ABI Research 's $22.3 billion AI estimate for the year. Keep in mind that all of this ignores crypto-native quirks like airdrops, which put fresh capital in the hands of users and, in turn, pump the token price, inflating the size of projects' treasuries. A recent report from Dragonfly found that between 2020 and 2024, the 11 largest airdrops generated $7 billion. This won't close the gap between AI and crypto, but it shows that there are more ways to get a dollar than traditional venture capital.", "published_on": "2025-03-14T14:11:02", "url": "https://www.coindesk.com/markets/2025/03/14/ai-s-lead-over-crypto-for-vc-dollars-increased-in-q1-25-but-does-this-race-really-matter", "source": "coindesk", "categories": ["BUSINESS", "MARKET", "EXCHANGE", "TRADING", "BNB", "FIAT"], "sentiment": {"polarity": 0.04772727272727273, "subjectivity": 0.41861471861471866, "sentiment": "neutral"}, "entities": [], "topics": ["billion", "deal", "million", "show"]}, {"id": "41630345", "title": "Solana’s SIMD-228 proposal to reduce SOL inflation by 80% fails to meet approval threshold", "body": "SIMD-228, a proposal seeking to reduce SOL inflation rate by 80%, failed to meet the required vote threshold for approval after many small validators voted against it. According to SIMD Vote Status, 61.39% of voters supported the SIMD-228 governance vote, which was less than the 66.67% required for approval. With a record 74% turnout by the end of voting on Mar. 13, it was the biggest crypto governance vote ever in terms of both market value and participation. The voting pattern revealed a rift among network members despite high engagement. More than 60% of smaller validators with 500,000 Solana ( SOL ) or less voted against the proposal. Validators with greater stakes, on the other hand, overwhelmingly backed it, indicating how the proposal would have impacted various groups. The current inflation system in Solana strikes a balance between burning transaction fees and generating staking rewards. More fees are burned during periods of high network activity, which helps keep inflation under control. You might also like: Solana still leads in DEX trading volumes despite meme coin frenzy cool-off However, fewer tokens are being removed from circulation as transaction costs have declined. Meanwhile, at an inflation rate of 4.7%, staking rewards keep adding new SOL to the market. The goal of SIMD -228 was to reduce staking rewards, which would slow the growth of SOL’s supply and potentially raise its value. Under the proposal, inflation would have fallen below 1% at the current 65% staking rate. However, smaller validators would have had difficulty remaining profitable, as many of them charge little to no commission. If enough of them left the network, Solana’s decentralization could have weakened, raising concerns about long-term stability. While SIMD-228 failed, a different proposal, SIMD-123, passed with almost 75% support. This modification will enable validators to distribute rewards more transparently by allowing them to split a portion of their earnings with stakeholders via an on-chain system. According to the findings from the just concluded vote, network participants prefer changing validator incentives over lowering inflation. Read more: Solana under potential capitulation as SOL price drops below key metric for first time since 2022", "published_on": "2025-03-14T14:10:57", "url": "https://crypto.news/simd-228-proposal-cut-sol-inflation-rate-fails-2025/", "source": "crypto_news", "categories": ["SOL", "MARKET", "TRADING"], "sentiment": {"polarity": 0.06282907196969698, "subjectivity": 0.48363162878787885, "sentiment": "neutral"}, "entities": ["solana"], "topics": ["simd", "inflation", "proposal", "vote"]}, {"id": "41630337", "title": "Bitcoin and Ethereum Options Expiration May Influence Short-Term Market Volatility", "body": "The cryptocurrency market is bracing for significant fluctuations as $3.29 billion in Bitcoin and Ethereum options expire today, stirring trader sentiment. With Bitcoin options making up $2.88 billion of the", "published_on": "2025-03-14T14:10:43", "url": "https://en.coinotag.com/bitcoin-and-ethereum-options-expiration-may-influence-short-term-market-volatility/", "source": "coinotag", "categories": ["ETH", "BTC", "MARKET", "FLOW"], "sentiment": {"polarity": 0.375, "subjectivity": 0.875, "sentiment": "positive"}, "entities": ["bitcoin", "ethereum"], "topics": ["option", "billion", "expiration", "influence"]}, {"id": "41630295", "title": "Stellar’s XLM Outshines the Crypto Market with Promising Growth Potential", "body": "XLM has gained over 5% while major cryptocurrencies decline. Technical indicators suggest a potential price surge for XLM. Continue Reading: Stellar’s XLM Outshines the Crypto Market with Promising Growth Potential The post Stellar’s XLM Outshines the Crypto Market with Promising Growth Potential appeared first on COINTURK NEWS .", "published_on": "2025-03-14T14:08:54", "url": "https://en.coin-turk.com/stellars-xlm-outshines-the-crypto-market-with-promising-growth-potential/", "source": "cointurken", "categories": ["XLM", "MARKET", "TRADING"], "sentiment": {"polarity": 0.12788461538461537, "subjectivity": 0.5525641025641025, "sentiment": "positive"}, "entities": ["stellar"], "topics": ["potential", "stellars", "outshines", "promising"]}], "sentiment": {"solana": {"positive": 1, "negative": 0, "neutral": 5, "total": 6, "overall_score": 0.07528271731861595, "overall": "Neutral"}, "bitcoin": {"positive": 5, "negative": 1, "neutral": 10, "total": 16, "overall_score": 0.0647374278998526, "overall": "Neutral"}, "ethereum": {"positive": 3, "negative": 0, "neutral": 6, "total": 9, "overall_score": 0.10577587505257406, "overall": "Positive"}, "shiba inu": {"positive": 0, "negative": 0, "neutral": 2, "total": 2, "overall_score": 0.09367936056998555, "overall": "Neutral"}, "near protocol": {"positive": 1, "negative": 0, "neutral": 2, "total": 3, "overall_score": 0.0922757010772884, "overall": "Neutral"}, "ripple": {"positive": 3, "negative": 0, "neutral": 9, "total": 12, "overall_score": 0.10520345004403693, "overall": "Positive"}, "dogecoin": {"positive": 2, "negative": 0, "neutral": 2, "total": 4, "overall_score": 0.10897789360721231, "overall": "Positive"}, "litecoin": {"positive": 1, "negative": 0, "neutral": 1, "total": 2, "overall_score": 0.11779689647323574, "overall": "Positive"}, "polkadot": {"positive": 0, "negative": 0, "neutral": 1, "total": 1, "overall_score": 0.0031686179981634532, "overall": "Neutral"}, "cardano": {"positive": 0, "negative": 0, "neutral": 1, "total": 1, "overall_score": 0.04081860269360269, "overall": "Neutral"}, "stellar": {"positive": 1, "negative": 0, "neutral": 1, "total": 2, "overall_score": 0.08435160903910903, "overall": "Neutral"}, "chainlink": {"positive": 0, "negative": 0, "neutral": 1, "total": 1, "overall_score": 0.09735872113997109, "overall": "Neutral"}, "uniswap": {"positive": 0, "negative": 0, "neutral": 1, "total": 1, "overall_score": 0.09735872113997109, "overall": "Neutral"}}, "topics": {"million": 5, "billion": 5, "could": 5, "user": 4, "level": 4, "proposal": 3, "three": 3, "arrow": 3, "capital": 3, "claim": 3, "liquidator": 3, "potential": 3, "inflation": 2, "solana": 2, "coinbase": 2, "inflow": 2, "bank": 2, "march": 2, "memecoin": 2, "investor": 2, "trump": 2, "ripple": 2, "platform": 2, "presale": 2, "support": 2, "pepe": 2, "bankruptcy": 2, "listing": 2, "option": 2, "institutional": 2, "volume": 2, "community": 1, "model": 1, "invest": 1, "holding": 1, "decline": 1, "return": 1, "bezosbacked": 1, "stark": 1, "brazil": 1, "firm": 1, "shiba": 1, "shib": 1, "holder": 1, "total": 1, "amount": 1, "adoption": 1, "finance": 1, "mutuum": 1, "mutm": 1, "rate": 1, "stock": 1, "pain": 1, "injunction": 1, "however": 1, "website": 1, "feature": 1, "pumpfun": 1, "messaging": 1, "recession": 1, "affect": 1, "price": 1, "russian": 1, "company": 1, "russia": 1, "trade": 1, "stablecoin": 1, "spark": 1, "excitement": 1, "resistance": 1, "breakdown": 1, "daily": 1, "there": 1, "trader": 1, "risk": 1, "asset": 1, "analyst": 1, "warns": 1, "dogecoins": 1, "final": 1, "cheap": 1, "webbay": 1, "marketplace": 1, "decentralized": 1, "trend": 1, "bitlemons": 1, "blem": 1, "earn": 1, "borrow": 1, "product": 1, "spot": 1, "fund": 1, "lead": 1, "high": 1, "lightchain": 1, "early": 1, "bear": 1, "today": 1, "altcoins": 1, "news": 1, "fall": 1, "court": 1, "doginme": 1, "roadmap": 1, "sale": 1, "project": 1, "wlfi": 1, "consensus": 1, "zksync": 1, "program": 1, "focus": 1, "strategic": 1, "contract": 1, "market": 1, "expiring": 1, "wave": 1, "egrag": 1, "fraud": 1, "guilty": 1, "wire": 1, "lunardi": 1, "administration": 1, "meme": 1, "cryptosensei": 1, "video": 1, "santiment": 1, "intelligence": 1, "attributed": 1, "durag": 1, "memecoins": 1, "duragdoge": 1, "liquidation": 1, "short": 1, "bitcoins": 1, "mexc": 1, "usdt": 1, "surge": 1, "upbit": 1, "dominates": 1, "function": 1, "article_register_shortcode": 1, "none": 1, "filing": 1, "investment": 1, "deal": 1, "show": 1, "simd": 1, "vote": 1, "expiration": 1, "influence": 1, "stellars": 1, "outshines": 1, "promising": 1}}